{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from wayne_utils import load_data, save_data\n",
    "from tqdm import tqdm\n",
    "import os\n",
    "import re\n",
    "'''os.chdir( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL\")\n",
    "from exec_post.nebula_execute import DB_execute'''\n",
    "\n",
    "tests = load_data( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/data/N3/test_data_shuffle.jsonl\", \"jsonl\")\n",
    "trains = load_data( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/data/N3/train_data_shuffle.jsonl\", \"jsonl\")\n",
    "datasets_schema = load_data( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/methods/MyMethod/N3/edge_vertex.json\", \"json\")\n",
    "\n",
    "test_gql_list = [ tests[i][\"content\"] for i in range(len(tests))]       # 1254  # 去重后511\n",
    "train_gql_list = [ trains[i][\"content\"] for i in range(len(trains))]    # 3862  # 822\n",
    "\n",
    "disease_gql_list = []           # 221 / 286\n",
    "nba_gql_list = []               # 597 / 3670\n",
    "potter_gql_list = []            # 231 / 236\n",
    "others_gql_list = []            # 252 / 924\n",
    "for lists in [ tests, trains]:\n",
    "    for i in range(len(lists)):\n",
    "        schema = lists[i]['schema']\n",
    "        if \"player(Tag)\" in schema:\n",
    "            nba_gql_list.append( lists[i][\"content\"] )\n",
    "        elif \"class drug\" in schema:\n",
    "            disease_gql_list.append( lists[i][\"content\"] )\n",
    "        elif \"class character\" in schema:\n",
    "            potter_gql_list.append( lists[i][\"content\"] )\n",
    "        else:\n",
    "            # raise Exception( f\"{i}不合法的schema {schema}\")\n",
    "            others_gql_list.append(lists[i][\"content\"] )\n",
    "\n",
    "unique_list_disease = list( set( disease_gql_list ) )\n",
    "unique_list_nba = list( set( nba_gql_list ) )\n",
    "unique_list_potter = list( set( potter_gql_list ) )\n",
    "unique_list_other = list( set( others_gql_list ) )\n",
    "\n",
    "all_gql = []\n",
    "all_gql.extend( test_gql_list )\n",
    "all_gql.extend( train_gql_list )    # 5116\n",
    "unique_list = list(set(all_gql))    # 1300\n",
    "unique_test_list = list( set(test_gql_list))    # 511\n",
    "# save_data( unique_test_list, \"all_test_unique_list.json\")\n",
    "\n",
    "from type_stat import nGQL_classify\n",
    "# dict_keys(['INSERT', 'OTHER_WRITE', 'MATCH', 'FETCH PROP ON', 'LOOKUP ON', 'FIND', 'GET SUBGRAPH', 'GO', 'SHOW', 'MIXED', 'QUICK_RETURN', 'OTHER'])\n",
    "class_dict = nGQL_classify( unique_list )\n",
    "\n",
    "test_pair = load_data( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/methods/MyMethod/N3/intentions/nl_query_pair/test_pair.json\", \"json\")\n",
    "train_pair = load_data( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/methods/MyMethod/N3/intentions/nl_query_pair/train_pair.json\", \"json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'INSERT': ['INSERT VERTEX t2 (name, age) VALUES \"11\":(\"n2\", 13)',\n",
       "  'INSERT VERTEX school(name, found_time) VALUES \"DUT\":(\"DUT\", timestamp(\"1988-03-01T08:00:00\"))',\n",
       "  'INSERT VERTEX t1(a, b) VALUES \"player100\":(\"Hello\", 100)',\n",
       "  'INSERT EDGE follow(degree)\\nVALUES \"player100\"->\"player101\":(95)',\n",
       "  'INSERT EDGE e1(p1) VALUES \"1\"->\"2\"@0:(10)',\n",
       "  'INSERT EDGE IF NOT EXISTS like(likeness) VALUES \"Tom\"->\"Conan\":(10)',\n",
       "  'INSERT VERTEX person(p1) VALUES \"1\":(1)',\n",
       "  'INSERT VERTEX player(name, age) VALUES \"player101\":(\"Tony Parker\", 36)',\n",
       "  'INSERT VERTEX school(name, found_time) VALUES \"dut\":(\"dut\", now())',\n",
       "  'INSERT VERTEX person(p1) VALUES \"2\":(2)',\n",
       "  'INSERT EDGE like VALUES \"Tom\"->\"Conan\":(200)',\n",
       "  'INSERT VERTEX player(name, age) VALUES \"player100\":(\"Tim Duncan\", 42)',\n",
       "  'INSERT VERTEX team(name) VALUES \"team203\":(\"Trail Blazers\"), \"team204\":(\"Spurs\")',\n",
       "  'insert edge serve(start_year,end_year)\\nvalues \"player100\"->\"team204\"@1:(1998, 2017)',\n",
       "  'INSERT VERTEX t5(p1, p2, p3) VALUES \"001\":(\"Abe\", 2, 3)',\n",
       "  'INSERT EDGE like(likeness) VALUES \"Tom\"->\"Conan\":(100)',\n",
       "  'INSERT VERTEX player(name) VALUES \"Kobe\":(\"Kobe\")',\n",
       "  'INSERT EDGE follow(degree) VALUES \"player101\" -> \"player100\":(95)',\n",
       "  'INSERT EDGE follow(degree) VALUES \"player101\" -> \"player102\":(90)',\n",
       "  'INSERT VERTEX t2 (name, age) VALUES \"11\":(\"n3\", 14)',\n",
       "  'INSERT EDGE serve(start_year, end_year) VALUES \"player101\" -> \"team204\":(1999, 2018),\"player102\" -> \"team203\":(2006, 2015)',\n",
       "  'INSERT VERTEX player(name, age) VALUES \"A Loner\": (\"A Loner\", 0);\\nDELETE VERTEX \"A Loner\" WITH EDGE;',\n",
       "  'INSERT EDGE e1(p1) VALUES \"1\"->\"2\"@1:(11)',\n",
       "  'INSERT VERTEX test1(p1, p2),test2(p3, p4) VALUES \"test\":(\"123\", 1, \"456\", 2)',\n",
       "  'INSERT VERTEX player(name, age) VALUES \"Kobe\":(\"Kobe\",null)',\n",
       "  'INSERT VERTEX school(name, found_time) VALUES \"dut\":(\"dut\", timestamp())',\n",
       "  'insert edge serve(start_year,end_year)\\nvalues \"player100\"->\"team204\"@2:(1990, 2018)',\n",
       "  'INSERT VERTEX any_shape(geo) VALUES \"103\":(ST_GeogFromText(\"POLYGON((0 1, 1 2, 2 3, 0 1))\"))',\n",
       "  'INSERT VERTEX player(name,age) VALUES \"player111\":(\"David West\", 38)',\n",
       "  'INSERT VERTEX player(name, age) VALUES \"player102\":(\"LaMarcus Aldridge\", 33)',\n",
       "  'INSERT EDGE any_shape_edge(geo) VALUES \"201\"->\"302\":(ST_GeogFromText(\"POLYGON((0 1, 1 2, 2 3, 0 1))\"))',\n",
       "  'INSERT EDGE follow(degree) VALUES \"player102\" -> \"player100\":(75)'],\n",
       " 'OTHER_WRITE': ['GO FROM \"Boris Diaw\" OVER like\\nYIELD like._src as src, like._dst as dst, like._rank as rank\\n| DELETE EDGE like $-.src->$-.dst @ $-.rank',\n",
       "  'DELETE TAG test1 FROM \"test\"',\n",
       "  'DELETE EDGE follow \"player101\" -> \"team204\"',\n",
       "  'UPSERT VERTEX \"player111\" SET player.name = \"David\", player.age = $^.player.age + 11\\nWHEN $^.player.name == \"David West\" AND $^.player.age > 20\\nYIELD $^.player.name AS Name, $^.player.age AS Age',\n",
       "  'UPSERT VERTEX ON player \"player668\"\\nSET name = \"Amber\", age = age + 1\\nYIELD name AS Name, age AS Age',\n",
       "  'DELETE VERTEX \"Grant Hill\" WITH EDGE',\n",
       "  'GO FROM \"Boris Diaw\" OVER like YIELD like._dst as id | DELETE VERTEX $-.id WITH EDGE',\n",
       "  '$var = GO FROM \"Russell Westbrook\" OVER like YIELD like._dst as id; DELETE VERTEX $var.id WITH EDGE',\n",
       "  'DELETE TAG player FROM \"Tim Duncan\", \"Tony Parker\";',\n",
       "  'UPDATE VERTEX ON player \"player101\"\\nSET age = age + 2\\nWHEN name == \"Tony Parker\"\\nYIELD name AS Name, age AS Age',\n",
       "  'DELETE VERTEX \"player111\", \"team203\"',\n",
       "  'UPSERT EDGE on serve_with_default\\n\"player668\" -> \"team200\"\\nSET end_year = end_year + 1\\nYIELD start_year, end_year',\n",
       "  'UPDATE EDGE ON follow \"player101\" -> \"player100\" SET degree = 96',\n",
       "  'DELETE VERTEX \"Tony Parker\" WITH EDGE;',\n",
       "  'UPSERT VERTEX ON player \"player666\"\\nSET age = 31\\nWHEN name == \"Joe\"\\nYIELD name AS Name, age AS Age',\n",
       "  'UPSERT VERTEX ON player \"player666\"\\nSET age = 30\\nWHEN name == \"Joe\"\\nYIELD name AS Name, age AS Age',\n",
       "  'UPSERT EDGE on serve\\n\"player666\" -> \"team200\"@0\\nSET end_year = 2022\\nWHEN end_year == 2010\\nYIELD start_year, end_year',\n",
       "  'UPSERT EDGE on serve\\n\"player668\" -> \"team200\"@0\\nSET start_year = 2000, end_year = end_year + 1\\nYIELD start_year, end_year',\n",
       "  'DELETE VERTEX \"team1\" WITH EDGE',\n",
       "  'UPSERT EDGE on serve\\n\"player666\" -> \"team200\"@0\\nSET end_year = 2021\\nWHEN end_year == 2010\\nYIELD start_year, end_year',\n",
       "  'UPSERT EDGE on serve\\n\"player149\" -> \"team219\"\\nSET end_year = end_year + 1\\nWHEN start_year != 2016\\nYIELD start_year, end_year',\n",
       "  'DELETE VERTEX \"LeBron James\", \"Dwyane Wade\", \"Carmelo Anthony\" WITH EDGE;',\n",
       "  'UPSERT VERTEX ON player \"player667\"\\nSET age = 31\\nYIELD name AS Name, age AS Age',\n",
       "  'UPDATE VERTEX \"player100\" SET player.name = \"Tim\"',\n",
       "  'UPSERT EDGE on serve\\n\"player667\" -> \"team200\"@0\\nSET end_year = 2022\\nYIELD start_year, end_year',\n",
       "  '$var = GO FROM \"Tim Duncan\" OVER serve YIELD serve._dst as id; DELETE TAG team FROM $var.id',\n",
       "  'CREATE TAG INDEX ti1 ON t1(col1(5));',\n",
       "  'GO FROM \"Tim Duncan\" OVER serve YIELD serve._dst as id | DELETE TAG team FROM $-.id',\n",
       "  'UPDATE EDGE ON serve \"player100\" -> \"team204\"@0\\nSET start_year = start_year + 1\\nWHEN end_year > 2010\\nYIELD start_year, end_year',\n",
       "  'UPSERT EDGE on serve\\n\"player149\" -> \"team219\"\\nSET end_year = end_year + 1\\nWHEN start_year == 2016\\nYIELD start_year, end_year',\n",
       "  'GO FROM \"player100\" OVER serve WHERE properties(edge).start_year == \"2021\" YIELD dst(edge) AS id | DELETE VERTEX $-.id'],\n",
       " 'MATCH': [\"MATCH (v1)-[:like]->(v2:player)-[:serve]->(v3)\\nWHERE id(v3) == 'Spurs'\\nRETURN COUNT(*)\",\n",
       "  \"MATCH p = ()-[:like*2]->(v:player) WHERE id(v) == 'Grant Hill' RETURN p\",\n",
       "  'MATCH () --> (v) --> () RETURN count(*)',\n",
       "  'match (v:player)-[e:like{likeness:-1}]->()  RETURN e',\n",
       "  'match (src_v:player{name:\"Manu Ginobili\"})-[e:like*2..3]-(dst_v)\\n  return distinct properties(src_v).sex,properties(e[0]).degree as degree,properties(dst_v).name as name,src_v.player.age AS age, e[1].start_year,dst_v.player.age\\n  order by degree, name, age limit 5;',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\\nRETURN v2.player.name AS Name, v2.player.age AS Age\\nORDER BY Age DESC SKIP 1',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:like*0{likeness: 90}]-(v)\\nRETURN e, v',\n",
       "  \"MATCH (v:player)-[e]-(v2)\\nWHERE id(v)=='Marco Belinelli'\\nRETURN v2\",\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-->(v2:player)\\nRETURN v2.player.name AS Name',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\\nWHERE e.degree > 1\\nRETURN DISTINCT v2 AS Friends',\n",
       "  'MATCH p = shortestPath( (a:player{name:\"Tim Duncan\"})-[e*..5]-(b:player{name:\"Tony Parker\"}) )  RETURN e, p',\n",
       "  'MATCH (v:player)\\nWITH v.player.name AS n\\nRETURN n ORDER BY n LIMIT 3\\nUNION ALL\\nUNWIND [\"Tony Parker\", \"Ben Simmons\"] AS n\\nRETURN n',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\\nWHERE ALL(e_ in e WHERE e_.degree > 0)\\nRETURN DISTINCT v2 AS Friends',\n",
       "  \"MATCH (v1)-[:like]->(v2:player)-[:serve]->(v3)\\nWHERE id(v2) == 'Tim Duncan'\\nRETURN COUNT(*)\",\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow|serve*2]->(v2)\\nRETURN DISTINCT v2',\n",
       "  \"MATCH (v)-[:serve]->(t)\\nWHERE id(t) == 'Pistons'\\nRETURN v.player.name AS Name\",\n",
       "  'MATCH (v:player)\\nWHERE v.player.name>\"Grant Hill\" and  v.player.name<=\"Yao Ming\"\\nRETURN v',\n",
       "  'MATCH (v:player{name:\"Tony Parker\"})--(v2:player)\\nRETURN DISTINCT v2.player.name, v2.player.age',\n",
       "  'match ()-[e]->()\\nwhere abs(rank(e)) == 1 and e.start_year == 2016\\nRETURN e\\nlimit 1000',\n",
       "  \"MATCH (v)\\nWHERE id(v) IN ['James Harden', 'Jonathon Simmons', 'Klay Thompson', 'Dejounte Murray', 'Paul Gasol']\\n      OR true\\nRETURN v.player.name AS Name\",\n",
       "  'match (src_v:player{name:\"Manu Ginobili\"})-[e*2]-(dst_v)\\n  return properties(src_v).sex,properties(e[0]).degree as degree,properties(dst_v).name as name,src_v.player.age AS age, e[1].start_year,dst_v.player.age\\n  order by degree, name, age limit 5;',\n",
       "  'MATCH (v:player) RETURN v.player.age AS Age, v.player.name AS Name\\nORDER BY Age DESC, Name ASC',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve*0..1{start_year: 2000}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (:player{name:\"Kyrie Irving\"})-[e:like*2..3]->()\\nRETURN *',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*]->(v2)\\nRETURN v2 AS Friends',\n",
       "  \"MATCH (v)\\nWHERE id(v) IN ['James Harden', 'Jonathon Simmons', 'Klay Thompson', 'Dejounte Murray', 'Paul Gasol']\\n      AND (id(v) == 'James Harden' OR v.player.age == 23)\\nRETURN v.player.name AS Name\",\n",
       "  'MATCH (v:player{name:\"Ben Simmons\"})-[e:serve]-(v2)\\nRETURN e',\n",
       "  \"MATCH (v1) -[:like]-> (v)\\nWHERE id(v1) == 'Dejounte Murray'\\nRETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age DESCENDING, Name ASC\\nSKIP 3\",\n",
       "  'match (v:player) where id(v)==\"Carmelo Anthony\" return properties(v).age;',\n",
       "  'MATCH (v) RETURN v',\n",
       "  'MATCH ()-[e]->()\\nWITH e, properties(e) as props, keys(properties(e)) as kk\\nLIMIT 10000 WHERE [i in kk where props[i] == 90]\\nRETURN e',\n",
       "  'MATCH (v:player {name: \"DeAndre Jordan\"}) RETURN v',\n",
       "  'match ()-[e]->()\\nwhere abs(rank(e)) == 1 and e.start_year == 2020\\nRETURN e\\nlimit 1000',\n",
       "  'match (v:player) where properties(v).name==\"LaMarcus Aldridge\" return v.player.sex,properties(v).age;',\n",
       "  'MATCH p=(v:player)-[]->(n)\\nWHERE id(v)==\"Tim Duncan\" and n.player.age>30\\nRETURN p LIMIT 100',\n",
       "  'MATCH (v:player) RETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Name DESC',\n",
       "  'MATCH (v:player) UNWIND (v)-[:teammate]->() AS p RETURN p',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:serve|like*2..3{start_year: 2000}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (n)<-[e:like*2..3{likeness: 90}]-(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH (v:player{name: \"abc\"}) -[:serve*1..3]-> ()\\nRETURN *',\n",
       "  'MATCH (p1)-[:teammate]->(p2)\\nRETURN p1.player.name, p2.player.name',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[e:follow|:serve]->(v2)\\nRETURN e',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})<-[e:serve|like*2..3{likeness: 90}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:like*0..1{likeness: 90}]->(v)\\nRETURN e, v',\n",
       "  'match (player)-[s:serve]->(team) where s.start_year == 2001 return player.player.name AS player, team.team.name AS team',\n",
       "  'MATCH (a:player)-[b:serve]-(c:team{name: \"Lakers\"})\\nWHERE a.player.age > 45\\nRETURN  concat(a.player.name, \"hello\")',\n",
       "  'MATCH p=(v)-[e*1]->(v2) WHERE id(v) IN [\"Tom\"] RETURN p',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[e]->(t)\\nWHERE (v)-[e]->(t:team)\\nRETURN (v)-->()',\n",
       "  'match (src_v:player{name:\"Manu Ginobili\"})-[e]-(dst_v)\\n  return properties(src_v).age,properties(e).degree,properties(dst_v).name AS name,src_v.player.sex,e.start_year,dst_v.player.age\\n  order by name limit 3;',\n",
       "  'MATCH ()-[e:follow]->()\\nRETURN e\\nlimit 3',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})--(v2)\\nRETURN\\nCASE WHEN v2.team.name IS NOT NULL\\nTHEN v2.team.name\\nWHEN v2.player.name IS NOT NULL\\nTHEN v2.player.name END AS Name',\n",
       "  'MATCH (:player{name: \"Tim Duncan\"})-[e:like*2..3]->(v)\\nRETURN e, v',\n",
       "  'MATCH (v)\\nRETURN v.person.name LIMIT 3',\n",
       "  'MATCH (v:player)-[e:like]->(v2) WHERE none_direct_src(e) IN [\"Tony Parker\", \"Tim Duncan\"] RETURN *\\nMINUS\\nMATCH (v:player)-[e:like]->(v2) WHERE id(v) IN [\"Tony Parker\", \"Tim Duncan\"] RETURN *',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\\nRETURN v2.player.name AS Name, v2.player.age AS Age\\nORDER BY Age',\n",
       "  'MATCH (v:player{name:\"Tony Parker\"})\\nWITH v AS a\\nMATCH p=(o:player{name:\"Tim Duncan\"})-[]->(a)\\nRETURN o.player.name',\n",
       "  'MATCH (v:player)\\nWHERE v.player.name STARTS WITH \"t\"\\nRETURN v.player.name, v.player.age',\n",
       "  'MATCH (v)-[e:follow]->()\\nWHERE rank(e)==0\\nRETURN *',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:like*2..3]->()\\nRETURN *',\n",
       "  'MATCH p = (n)-[:like]-(m)\\nWHERE id(n) == \"LeBron James\"\\nRETURN p, n.player.name, m.player.name',\n",
       "  \"MATCH p = shortestPath( (a)-[e:like*..4]->(b) )\\n  WHERE id(b) IN ['Manu Ginobili', 'Spurs', 'Lakers'] and id(a) in ['xxx', 'zzz']\\n  RETURN p\",\n",
       "  'MATCH (v:player) RETURN max(v.player.age)',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-->()<--(v3)\\nRETURN v3.player.name AS Name',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\\nWHERE e[0].degree > 98\\nRETURN DISTINCT v2 AS Friends',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-->(v2) return length(p)',\n",
       "  'MATCH (:player{name: \"Tim Duncan\"})-[e:like*2..3]-(v)\\nRETURN COUNT(1)',\n",
       "  'MATCH (v:player)\\nWHERE v.player.age IN range(20,25)\\nRETURN v.player.name, v.player.age',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like{start_year: 2000}]->(v)\\nRETURN e, v',\n",
       "  'match (v:player{name:\"LaMarcus Aldridge\"}) return properties(v).age;',\n",
       "  'match (v:player) where id(v)==\"Carmelo Anthony\" return properties(v).age,v.player.sex;',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\\nRETURN v2.player.name AS Name, v2.player.age AS Age\\nORDER BY Age DESC SKIP 1 LIMIT 1',\n",
       "  'UNWIND [\"Tony Parker\", \"Tim Duncan\", \"Yao Ming\"] AS a MATCH (v:player) WHERE v.player.name == a RETURN distinct a, v',\n",
       "  'MATCH (v)\\nWHERE id(v)==\"player100\"\\nWITH labels(v) AS tags_unf\\nUNWIND tags_unf AS tags_f\\nRETURN tags_f',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*1..3]->(v2:player)\\nRETURN DISTINCT v2 AS Friends, count(v2)',\n",
       "  'MATCH (v:player{name:\"Tony Parker\"}) RETURN v',\n",
       "  \"MATCH (v1) -[:like]-> (v)\\nWHERE id(v1) == 'Dejounte Murray'\\nRETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age DESC, Name ASC\\nSKIP 3\\nLIMIT 3\",\n",
       "  'MATCH (v1) -[:like]-> (v2)\\nWHERE id(v1) == \"Danny Green\"\\nRETURN v1.player.name AS Name, v2.player.name AS Friend',\n",
       "  'MATCH (v:player)\\nWHERE v.player.name == \"Tim Duncan\"\\nXOR (v.player.age < 30 AND v.player.name == \"Yao Ming\")\\nOR NOT (v.player.name == \"Yao Ming\" OR v.player.name == \"Tim Duncan\")\\nRETURN v.player.name, v.player.age',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1]-(v)\\nRETURN e, v',\n",
       "  \"MATCH (v:player{name: 'Tim Duncan'})-[e:like{likeness: 95}]->() return v.player.name AS name\",\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1{likeness: 90}]->(v)\\nRETURN e, v',\n",
       "  'match ()-[e]->()\\nwhere rank(e) == 0\\nRETURN rank(e)\\nlimit 3',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[e]->(t) WHERE (v)-[e]->(t:team) RETURN (v)-->()',\n",
       "  'MATCH (n)-[e:serve*2..3]->(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  \"MATCH (v:player{name: 'Tim Duncan'})-[e]->() RETURN type(e), count(*)\",\n",
       "  \"MATCH (v)-[:serve]->(t)\\nWHERE (NOT NOT id(v) == 'Paul Gasol') AND id(v) == 'Paul Gasol' AND id(t) IN ['Grizzlies', 'Lakers']\\nRETURN v.player.name AS Name, t.team.name AS Team\",\n",
       "  'MATCH (a:player)-[b:serve]-(c:team{name: \"Lakers\"})\\nWHERE a.player.age > 45\\nRETURN concat_ws(\"@\",a.player.name, NULL, \"hello\", b.likeness, c.team.name) as result',\n",
       "  \"MATCH (v) WHERE id(v) == 'Boris Diaw' RETURN (v)\",\n",
       "  'match (v:player{name:\"LaMarcus Aldridge\"}) return v.player.age;',\n",
       "  'match (v1)-->(v2:player)-->(v3) where v2.player.name==\"Shaquille O\\'Neal\"\\n  return properties(v1).name,properties(v2).age as age,properties(v3).name AS name\\n  order by name limit 1;',\n",
       "  'MATCH (v:player {name: \"Rudy Gay\"})-[:serve*0..1]->(n) RETURN n.player.name',\n",
       "  'MATCH (v:player{name:\"Giannis Antetokounmpo\"}) RETURN v.name AS vname',\n",
       "  'MATCH (v)-[e:serve]->()\\nWHERE id(v)==\"player100\"\\nRETURN labels(v)',\n",
       "  \"MATCH p = shortestPath( (a:player)-[e:serve*..3]-(b:team) )\\n  WHERE a.player.age > 45 AND b.team.name == 'Spurs'\\n  RETURN length(p)\",\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\\nRETURN DISTINCT v2 AS Friends',\n",
       "  'MATCH (v:player{name:\"Tony Parker\"})--(v2:player)\\nRETURN v2.player.name, v2.player.age',\n",
       "  'MATCH (v:player)\\nWITH v.player.name AS Name\\nORDER BY Name DESC\\nLIMIT 3\\nRETURN collect(Name)',\n",
       "  \"MATCH p = allShortestPaths( (a:player)-[e:serve*..3]-(b:team) )\\n  WHERE a.player.name == 'Tim Duncan' AND b.team.name == 'Spurs'\\n  RETURN p\",\n",
       "  'MATCH (n)-[e:like*2..3]->(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH(n:player)\\n  RETURN id(n) AS id,\\n         count(n) AS count,\\n         sum(floor(n.player.age)) AS sum,\\n         max(n.player.age) AS max,\\n         min(n.player.age) AS min,\\n         avg(distinct n.player.age)+1 AS age,\\n         labels(n) AS lb\\n    ORDER BY id, count, max, min\\n    SKIP 10 LIMIT 8;',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1]->(v)\\nRETURN e, v',\n",
       "  \"MATCH (v1) -[:like]-> (v)\\nWHERE id(v1) == 'Dejounte Murray'\\nRETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age DESC, Name ASC\\nLIMIT 3\",\n",
       "  'match (src_v)-[e:like|serve]->(dst_v)-[e2]-(dst_v2) where  id(src_v)==\"Rajon Rondo\" return properties(e).degree1,properties(e).degree1,e2.a,dst_v.p.name,dst_v.player.sex1,properties(src_v).name2 limit 5;',\n",
       "  'MATCH (v:player {name: \"Yao Ming\"})-[:serve*1..3]->() RETURN v.player.name',\n",
       "  'MATCH (v:player{name: \"abc\"}) -[:serve*..3]-> ()\\nRETURN *',\n",
       "  'match (v0:player)-[e0]->(v1) where id(v0) == \"Tim Duncan\" unwind e0.start_year as a return avg(a)',\n",
       "  'MATCH (v:player)\\nWHERE NOT v.player.name ENDS WITH \"R\"\\nRETURN v.player.name, v.player.age',\n",
       "  \"MATCH (p:player {name: 'Yao Ming'} ), (t:team {name: 'Rockets'}), pth = (p)-[:serve*1..4]-(t)\\nRETURN pth\",\n",
       "  'MATCH (v:player)-[e]->()\\nWHERE e.start_year < 2000\\nRETURN DISTINCT v.player.name, v.player.age',\n",
       "  'MATCH p = shortestPath( (a:player{age:30})-[e*..5]->(b:team) )\\n  WHERE length(p) == 1\\n  RETURN p',\n",
       "  'MATCH p = (n)-[:like]->(m)\\nWHERE id(n) == \"LeBron James\"\\nRETURN p, n.player.name, m.player.name',\n",
       "  'MATCH (:player{name:\"Kyrie Irving\"})-[e:serve|like*2..3]-(v)\\nRETURN count(v)',\n",
       "  \"MATCH (v1) -[:like]-> (v)\\nWHERE id(v1) == 'Dejounte Murray'\\nRETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age DESC, Name ASC\\nLIMIT 0\",\n",
       "  'MATCH () -[]-> (v) RETURN *',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[e:follow{degree:95}]->(v2)\\nRETURN e',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:like{likeness: 90}]->(v)\\nRETURN e, v',\n",
       "  'MATCH (v1) -[r:serve]-> (v2)\\nWHERE id(v1) == \"LeBron James\"\\nRETURN type(r) AS Type, v2.team.name AS Name',\n",
       "  'MATCH (n)-[e:serve|like*2..3{likeness: 90}]->(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH p = shortestPath( (a:player{name:\"Tiago Splitter\"})-[e*..5]->(b:player{name:\"LaMarcus Aldridge\"}) )\\n  WHERE length(p) > 2\\n  RETURN  p',\n",
       "  \"MATCH (v)\\nWHERE id(v) != 'Paul Gasol'\\nRETURN v.player.name AS Name\",\n",
       "  'MATCH (n)-[e:like*2..3{likeness: 90}]->(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH (v:player)-[e:follow]->(v2)\\nWHERE id(v) == \"player102\"\\nRETURN id(v2) As id, e.degree As Degree, v2.player.age AS Age\\nINTERSECT\\nMATCH (v:player)-[e:follow]->(v2)\\nWHERE id(v) == \"player100\"\\nRETURN id(v2) As id, e.degree As Degree, v2.player.age AS Age',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) -[e]- (v2)\\nRETURN count(e)',\n",
       "  'MATCH p = (n)<-[:like]-(m)\\nWHERE id(n) == \"LeBron James\"\\nRETURN p, n.player.name, m.player.name',\n",
       "  'MATCH (v:player)-[:like]->(t) WHERE v.player.name==\"Tim Duncan\" RETURN v.player.name, t.errortag.name, properties(v), t',\n",
       "  'MATCH (v1:player{name: \"LeBron James\"}) -[r]-> (v2)\\nRETURN type(r) AS Type, CASE WHEN v2.tea.name IS NOT NULL THEN v2.tea.name WHEN v2.playe.name IS NOT NULL THEN v2.playe.name ELSE \"abc\" END AS Name',\n",
       "  'MATCH p = (v:player{name: \"Cory Joseph\"})-[e:like]-(v2)\\nRETURN p',\n",
       "  'MATCH (v:player{name: \"Damian Lillard\"})-[:like]-(v2)--(v3)\\nWITH v3, v3.player.age AS age\\nRETURN v3, age ORDER BY age LIMIT 3',\n",
       "  'MATCH (v:player)-->(v2:player)\\nWITH DISTINCT v2 AS v2, v2.player.age AS Age\\nORDER BY Age\\nWHERE Age<25\\nRETURN v2.player.name AS Name, Age',\n",
       "  'MATCH (v:team{name:\"Spurs\"})--(v2)\\nRETURN v2 AS Player',\n",
       "  'MATCH (v:player) RETURN std(v.player.age)',\n",
       "  'MATCH p= (v:player) -- (v2) WHERE id(v)==\"A\" RETURN p',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:like*0..1{likeness: 90}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (v:player) WHERE v.player.score < 20 RETURN v.player.name AS name',\n",
       "  'MATCH (v:player)\\nWHERE exists(v.player.age)\\nRETURN v.player.name, v.player.age',\n",
       "  \"MATCH (v:player{name: 'Rudy Gay'})-[e]->() RETURN type(e), count(*)\",\n",
       "  'MATCH (n)-[e:like*2..3]-(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH (v:player) RETURN min(v.player.age)',\n",
       "  \"MATCH (v1) -[:like]-> () -[:like]-> (v3)\\nWHERE id(v1) == 'Dwyane Wade'\\nRETURN v3.player.name AS Name\",\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})--()\\nWITH nodes(p) AS n\\nUNWIND n AS n1\\nRETURN DISTINCT n1',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-->(v2)\\nRETURN p',\n",
       "  'MATCH (v:player)\\nWITH v.player.name AS n\\nRETURN n ORDER BY n LIMIT 3\\nUNION\\nUNWIND [\"Tony Parker\", \"Ben Simmons\"] AS n\\nRETURN n',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) RETURN v',\n",
       "  'MATCH (n)-[e:serve*2..3{start_year: 2000}]-(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH (v:player:bachelor) RETURN v',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like{start_year: 2000}]-(v)\\nRETURN e, v',\n",
       "  'match (v:player{name:\"LaMarcus Aldridge\"}) return properties(v).age,v.player.sex;',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})--(v2:player)\\nRETURN v2.player.name AS Name',\n",
       "  'match (v:player) return properties(v).name AS name order by name limit 2;',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*0..3]->(v2:player)\\nRETURN DISTINCT v2 AS Friends, count(v2)',\n",
       "  'MATCH (n)-[e:serve|like*2..3{likeness: 90}]-(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  \"MATCH (v)<-[e:follow]- (v2) WHERE id(v) =='player100'\\nRETURN id(v2) AS destination\",\n",
       "  'MATCH (:player{name: \"Tim Duncan\"})-[e:like*2..3]-(v)\\nRETURN count(v)',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1{start_year: 2000}]->(v)\\nRETURN e, v',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-->(v2)<--(v3)\\nRETURN v3.player.name AS Name',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:serve*2..3{start_year: 2000}]->(v)\\nRETURN e, v',\n",
       "  'match p= (v:player)-[e:like*1..2]->(d) where v.player.age > 20 return e',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1{start_year: 2000}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (v:player)-[e]->(v2)\\nWHERE v2.player.age < 25\\nRETURN v2.player.name, v2.player.age',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-->(v2)\\nRETURN relationships(p)',\n",
       "  'match (v:player) where id(v)==\"Carmelo Anthony\" return v.player.age;',\n",
       "  'MATCH (:player{name: \"Tim Duncan\"})-[e1:like]->()-[e2:serve*0..3]->()<-[e3:serve]-(v)\\nRETURN count(v)',\n",
       "  'MATCH (v:player)\\nWHERE v[toLower(\"AGE\")] < 21\\nRETURN v.player.name, v.player.age',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:like*2..3{likeness: 90}]->(v)\\nRETURN e, v',\n",
       "  'MATCH (v:player)-[e:like]->(v2) WHERE none_direct_dst(e) IN [\"Tony Parker\", \"Tim Duncan\"] RETURN *\\nMINUS\\nMATCH (v:player)-[e:like]->(v2) WHERE id(v2) IN [\"Tony Parker\", \"Tim Duncan\"] RETURN *',\n",
       "  'MATCH p = (n)-[:like]->(m)-[:like]->(k)\\nWHERE id(n) == \"LeBron James\"\\nRETURN p, n.player.name, m.player.name, k.player.name',\n",
       "  \"MATCH (v1) -[:like]-> (v)\\nWHERE id(v1) == 'Dejounte Murray'\\nRETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age DESC, Name ASC\\nSKIP 11\\nLIMIT 3\",\n",
       "  'match (v:player{age: 1+19}) RETURN v',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:serve|like*2..3]-(v)\\nRETURN COUNT(1)',\n",
       "  'MATCH (v:player)-[e:like]->(v2)\\nWHERE id(v) == \"Tim Duncan\"\\nRETURN DISTINCT properties(e) as props, e',\n",
       "  'MATCH p2=(:player{name:\"Tim Duncan\"})-[e:like*1..2]-(:player{name:\"Tim Duncan\"})\\nRETURN e.likeness AS e1',\n",
       "  \"MATCH (v:player{name: 'Tim Duncan'}) return v.player.name AS name\",\n",
       "  'MATCH (v:player) WITH (v)-[:teammate]->() AS p RETURN p',\n",
       "  'MATCH (n:player)\\nRETURN n.player.age as age, count(*) as number\\nORDER BY number DESC, age DESC',\n",
       "  'MATCH (n)-[e:like*2..3{likeness: 90}]-(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  'MATCH p = shortestPath( (a:player{name:\"Tiago Splitter\"})-[e*..5]->(b:player{name:\"LaMarcus Aldridge\"}) ) RETURN  p',\n",
       "  'MATCH (v:player {name: \"Yao Ming\"})-[:serve*2..3]->() RETURN v.player.name',\n",
       "  'MATCH (n:player {name : \"Tim Duncan\"})-[]->(friend:player)-[]->(fof:player)\\nRETURN count(fof), count(DISTINCT fof)',\n",
       "  \"MATCH (v:player)-[e:like]->(t) WHERE v.player.name=='Carmelo Anthony'  RETURN v.player.name, v.player.age\",\n",
       "  \"MATCH (v)\\nWHERE id(v) IN ['James Harden', 'Jonathon Simmons', 'Klay Thompson', 'Dejounte Murray', 'Paul Gasol']\\n      AND true\\nRETURN v.player.name AS Name\",\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:like*0..1]-(v)\\nRETURN e, v',\n",
       "  \"MATCH (v)\\nWHERE id(v) == 'Tim Duncan'\\nRETURN v.player.name AS Name\",\n",
       "  'MATCH (:player{name: \"Vince Carter\"})-[e1:like]->()-[e2:serve*0..3]->()<-[e3:serve]-(v)\\nRETURN count(v)',\n",
       "  'MATCH (v1) -[:like]-> (v2) -[:like]-> (v3)\\nWHERE id(v1) == \"Tim Duncan\"\\nRETURN v1.player.name AS Player, v2.player.name AS Friend, v3.player.name AS FoF',\n",
       "  'MATCH p = (n)-[:like]->()-[:like]->()\\nWHERE id(n) == \"LeBron James\"\\nRETURN *',\n",
       "  'MATCH (v1) -[r]-> (v2)\\nWHERE id(v1) == \"LeBron James\"\\nRETURN type(r) AS Type, CASE WHEN v2.team.name IS NOT NULL THEN v2.team.name WHEN v2.player.name IS NOT NULL THEN v2.player.name END AS Name',\n",
       "  'MATCH (v1:player)-[:follow]-(v2:player)\\nWHERE id(v1)== \"player101\"\\nRETURN v2.player.name AS Name, count(*) as cnt ORDER BY cnt DESC',\n",
       "  'MATCH (v1) -[r]-> (v2)\\nWHERE id(v1) == \"LeBron James\"\\nRETURN type(r) AS Type, v2.team.name AS Name',\n",
       "  'MATCH (v:player{name: \"Tony Parker\"})-[:serve]->(t:team)\\nWITH DISTINCT v.player.age as age, t\\nRETURN t',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*1..3]->(v2)\\nRETURN v2 AS Friends',\n",
       "  'MATCH (v) -[e:follow*1..2]->(v2)\\nWHERE id(v) == \"player100\"\\nRETURN id(v2) AS destination',\n",
       "  'MATCH (n:player) WHERE id(n) == \"Boris Diaw\" RETURN n;',\n",
       "  'MATCH (v:player)\\nWHERE v.player.name ENDS WITH \"r\"\\nRETURN v.player.name, v.player.age',\n",
       "  'match (v1)-->(v2:player)-->(v3) where v2.player.name==\"Shaquille O\\'Neal\"\\n  return properties(v1).name,properties(v2).age as age,properties(v3).name AS name,v2.player.sex,v1.player.age\\n  order by age, name limit 1;',\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-->(v2)\\nRETURN nodes(p)',\n",
       "  'MATCH (p)-[:serve*0..3]->(t) RETURN p',\n",
       "  'MATCH (v1:player{name: \"LeBron James\"}) -[r:serve]-> (v2:team{name: \"Cavaliers\"})\\nRETURN type(r) AS Type, v2.team.name AS Name',\n",
       "  \"MATCH (a)--(b) WHERE id(b) == 'Tony Parker' RETURN DISTINCT id(a)\\nUNION\\nMATCH (a)--(b) WHERE id(b) == 'Tony Parker' RETURN DISTINCT id(a)\",\n",
       "  'MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*1..]->(v2)\\nRETURN v2 AS Friends',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\\nRETURN v2.player.name AS Name, v2.player.age AS Age\\nORDER BY Age DESC',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})<-[e:like*2..3{likeness: 90}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:serve|like*2..3]-(v)\\nRETURN COUNT(e)',\n",
       "  'match (src_v)-[e:like|serve]->(dst_v)-[e2]-(dst_v2) where  id(src_v)==\"Rajon Rondo\"\\n  return properties(e).degree as degree,properties(e2).degree AS degree1\\n  order by degree, degree1 limit 5;',\n",
       "  'MATCH (v:player {name: \"Yao Ming\"})-[:serve*0..1]->() RETURN v.player.name',\n",
       "  \"MATCH (a:player)\\nWHERE id(a)=='Tim Duncan'\\nMATCH (a)-[:like]-(b)\\nRETURN count(*) AS cnt\",\n",
       "  \"MATCH (v)-[:serve]->(t)\\nWHERE (NOT NOT id(v) == 'Paul Gasol') AND id(v) == 'Paul Gasol'\\nRETURN v.player.name AS Name, t.team.name AS Team\",\n",
       "  'MATCH(n:player)-[:like]->(m)\\n  WHERE n.player.age > 35\\n  RETURN DISTINCT id(n) AS id,\\n                  count(n) AS count,\\n                  sum(floor(n.player.age)) AS sum,\\n                  max(m.player.age) AS max,\\n                  min(n.player.age) AS min,\\n                  avg(distinct n.player.age)+1 AS age,\\n                  labels(m) AS lb\\n        ORDER BY id, count, max, min\\n        SKIP 10 LIMIT 20;',\n",
       "  'MATCH (:player{name:\"Tracy McGrady\"})-[e:like*1{likeness: 90}]->(v)\\nRETURN e, v',\n",
       "  \"MATCH (v)<-[e:follow]- (v2)-[e2:serve]->(v3)\\nWHERE id(v) =='player100'\\nRETURN v2.player.name AS FriendOf, v3.team.name AS Team\",\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[]->(v2)<-[e:serve]-(v3)\\nRETURN v2, v3',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\\nRETURN v2.player.name AS Name, v2.player.age AS Age\\nORDER BY Age DESC SKIP 1+1',\n",
       "  'MATCH ()<-[e]-()\\nRETURN e\\nLIMIT 3',\n",
       "  'match (v:player) return v.player.name, v',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[e]->()\\nRETURN keys(e)',\n",
       "  'MATCH (v:player)\\nWHERE v.player.name CONTAINS \"Pa\"\\nRETURN v.player.name, v.player.age',\n",
       "  'MATCH (v:player)-[e:follow]->(v2)\\nWHERE id(v) ==\"player102\"\\nRETURN id(v2) AS id\\nMINUS\\nMATCH (v:player)-[e:follow]->(v2)\\nWHERE id(v) ==\"player100\"\\nRETURN id(v2) AS id',\n",
       "  'MATCH (v:player) RETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age LIMIT 5',\n",
       "  'MATCH (n)-[e:serve|like*2..3]->(v)\\nWHERE id(n) == \"Tim Duncan\"\\nRETURN e, v',\n",
       "  \"MATCH (v1)-[:like]->(v2:player)-[:serve]->(v3)\\nWHERE id(v3) == 'Spurs' AND id(v1) == 'Tony Parker'\\nRETURN v1, v2, v3\",\n",
       "  'MATCH (v:player)\\nWHERE v.player.age NOT IN range(20,25)\\nRETURN v.player.name AS Name, v.player.age AS Age\\nORDER BY Age',\n",
       "  'MATCH (v:player) WHERE [t in [v] | (v)-[:like]->(t)] RETURN v.player.name AS name',\n",
       "  'MATCH (:player{name:\"Tim Duncan\"})-[e:like*2..3{likeness: 90}]-(v)\\nRETURN e, v',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"})-[e]->(t)\\nWHERE NOT (v)-[e]->(t:team)\\nRETURN (v)-->()',\n",
       "  'MATCH (v:player{name:\"Tim Duncan\"}) -[*0]-> (v2)\\nRETURN v2',\n",
       "  'MATCH (v:player) RETURN sum(v.player.age)'],\n",
       " 'FETCH PROP ON': ['FETCH PROP ON player, t1 \"player100\" YIELD vertex AS v',\n",
       "  'FETCH PROP ON serve \"player100\" -> \"team204\", \"player133\" -> \"team202\" YIELD edge AS e',\n",
       "  '$v1 = FETCH PROP ON player \"Tony Parker\"\\nYIELD properties(Vertex) AS props, properties(Vertex).name AS name, properties(Vertex).age AS age',\n",
       "  'FETCH PROP ON * \"player100\", \"player106\", \"team200\" YIELD vertex AS v',\n",
       "  'FETCH PROP ON player \"Tony Parker\" YIELD player.name, player.age',\n",
       "  'FETCH PROP ON follow \"player101\" -> \"player100\" YIELD properties(edge)',\n",
       "  'FETCH PROP ON any_shape \"103\" YIELD ST_ASText(any_shape.geo)',\n",
       "  \"FETCH PROP ON player 'Boris Diaw' YIELD vertex as node\",\n",
       "  \"FETCH PROP ON * 'Boris Diaw' yield player.name, player.age\",\n",
       "  \"FETCH PROP ON * 'Tim Duncan' YIELD  id(vertex), keys(vertex) as keys, tags(vertex) as tags_, properties(vertex) as props\",\n",
       "  \"FETCH PROP ON * 'Tim Duncan' YIELD id(vertex), keys(vertex) as keys, tags(vertex) as tags_, properties(vertex) as props\",\n",
       "  'FETCH PROP ON serve \"Boris Diaw\"->\"Spurs\" YIELD edge as relationship, src(edge) as src_edge, dst(edge) as dst_edge, type(edge) as type, rank(edge) as rank',\n",
       "  'FETCH PROP ON * \"test\" YIELD vertex AS v',\n",
       "  'FETCH PROP ON player, t1 \"player100\", \"player103\" YIELD vertex AS v',\n",
       "  'FETCH PROP ON serve \"Boris Diaw\"->\"Spurs\" YIELD serve.start_year, serve.start_year',\n",
       "  'FETCH PROP ON player \"player100\"\\nYIELD properties(vertex).name AS name',\n",
       "  'FETCH PROP ON player \"Grant Hill\" YIELD player.name, player.age',\n",
       "  \"FETCH PROP ON player 'Boris Diaw' YIELD player.name, player.age\",\n",
       "  'FETCH PROP ON * \"player666\", \"player667\", \"player668\" YIELD properties(vertex)',\n",
       "  'FETCH PROP ON serve \"Tony Parker\"->\"Spurs\" YIELD serve.start_year, serve.end_year',\n",
       "  'FETCH PROP ON serve \"player100\" -> \"team204\"\\nYIELD properties(edge).start_year',\n",
       "  \"FETCH PROP ON player 'Boris Diaw' YIELD player.name, player.age, player.age > 30\",\n",
       "  'FETCH PROP ON player \"Carmelo Anthony\" YIELD player.name, player.age',\n",
       "  'FETCH PROP ON serve \"player100\" -> \"team204\"@1 YIELD edge AS e',\n",
       "  'FETCH PROP ON serve \\'Boris Diaw\\'->\"Spurs\" YIELD serve._src, serve._dst, serve._rank',\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD edge as e |\\nYIELD startNode($-.e) AS nodes',\n",
       "  'FETCH PROP ON player \"player100\" YIELD properties(vertex)',\n",
       "  'FETCH PROP ON player \"Boris Diaw\", \"Tony Parker\" YIELD DISTINCT player.name, player.age',\n",
       "  'FETCH PROP ON player \"Tim Duncan\" YIELD player.name, player.age',\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD edge as relationship |\\nYIELD startNode($-.relationship) AS node',\n",
       "  \"FETCH PROP ON * 'Tim Duncan' YIELD vertex as node\",\n",
       "  'FETCH PROP ON player \"Jason Kidd\" YIELD player.name, player.age',\n",
       "  'FETCH PROP ON t2 \"11\" YIELD properties(vertex)',\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD properties(edge) as properties',\n",
       "  \"FETCH PROP ON * 'Boris Diaw', 'Boris Diaw' yield player.name, player.age\",\n",
       "  \"YIELD 'Boris Diaw' as id | FETCH PROP ON * $-.id yield player.name, player.age\",\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD edge as relationship |\\nYIELD properties($-.relationship)',\n",
       "  \"FETCH PROP ON player 'Boris Diaw', 'Tony Parker' YIELD vertex as node | YIELD id($-.node) as id\",\n",
       "  'FETCH PROP ON team \"Spurs\" YIELD team.name',\n",
       "  'FETCH PROP ON serve \"player100\" -> \"team204\" YIELD properties(edge)',\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD edge as e |\\nYIELD properties($-.e)',\n",
       "  '$v1 = YIELD \"Ray Allen\" AS a;\\nFETCH PROP ON player $v1.a YIELD player.name AS name',\n",
       "  'FETCH PROP ON serve \"Boris Diaw\"->\"Spurs\" YIELD edge as e',\n",
       "  'FETCH PROP ON any_shape_edge \"201\"->\"302\" YIELD ST_ASText(any_shape_edge.geo)',\n",
       "  \"FETCH PROP ON serve 'Boris Diaw' -> 'Hawks' YIELD serve.start_year, serve.end_year\",\n",
       "  'FETCH PROP ON player \"Kobe\" YIELD properties(vertex)',\n",
       "  \"FETCH PROP ON serve 'Boris Diaw' -> 'Hawks' YIELD serve.start_year, serve.end_year, edge as relationship\",\n",
       "  \"FETCH PROP ON * 'Boris Diaw' YIELD id(vertex), player.age, vertex as node\",\n",
       "  'FETCH PROP ON player \"player100\"\\nYIELD properties(vertex).name',\n",
       "  'FETCH PROP ON serve \"player100\" -> \"team204\" YIELD edge AS e',\n",
       "  \"FETCH PROP ON * 'Boris Diaw' YIELD vertex as node\",\n",
       "  'FETCH PROP ON serve \"Zion Williamson\"->\"Spurs\", \"Boris Diaw\"->\"Hawks\" YIELD serve.start_year',\n",
       "  \"FETCH PROP ON player 'Boris Diaw' YIELD player.name, player.name\",\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD edge as e |\\nYIELD endNode($-.e) AS nodes',\n",
       "  'FETCH PROP ON serve \"Boris Diaw\"->\"Not Exist\" YIELD src(edge) as a',\n",
       "  'FETCH PROP ON player \"player101\", \"player102\", \"player103\" YIELD properties(vertex)',\n",
       "  'FETCH PROP ON like \"Tony Parker\"->\"Tim Duncan\", \"Grant Hill\" -> \"Tracy McGrady\" YIELD edge as relationship |\\nYIELD endNode($-.relationship) AS node',\n",
       "  'FETCH PROP ON player \"player101\" YIELD properties(vertex)',\n",
       "  'FETCH PROP ON player \"player100\", \"player101\", \"player102\", \"player103\"\\nYIELD properties(vertex).age AS age, properties(vertex).name AS name\\n| ORDER BY $-.age ASC, $-.name DESC',\n",
       "  \"FETCH PROP ON * 'Boris Diaw' YIELD id(vertex)\",\n",
       "  \"FETCH PROP ON * 'Boris Diaw' YIELD id(vertex), player.age\"],\n",
       " 'LOOKUP ON': ['LOOKUP ON player\\nYIELD player.age As playerage\\n| GROUP BY $-.playerage\\nYIELD $-.playerage as age, count(*) AS number\\n| ORDER BY $-.number DESC, $-.age DESC',\n",
       "  \"LOOKUP ON player\\nWHERE player.name == 'Tim Duncan'\\nYIELD player.age as age, id(vertex) as vid\\n| UNWIND $-.vid as a | YIELD $-.a AS a\",\n",
       "  'LOOKUP ON like where like.likeness > 89 YIELD src(edge) as src, dst(edge) as dst, rank(edge) as rank',\n",
       "  'LOOKUP ON player YIELD id(vertex)|\\nYIELD COUNT(*) AS Player_Number',\n",
       "  'LOOKUP ON player WHERE player.age >= 29 YIELD id(vertex) as name, player.age AS Age',\n",
       "  'LOOKUP ON t1 WHERE t1.col4 == \"durian\" AND t1.col2 <= 2.0 YIELD id(vertex) as id',\n",
       "  'LOOKUP ON player WHERE player.name == \"Tim Duncan\" YIELD id(vertex) as id',\n",
       "  'LOOKUP ON serve YIELD serve.start_year AS startYear',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 >= 1 AND e1.col3 > false YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON t1 WHERE t1.col3 == false AND t1.col1 >= 1 YIELD id(vertex) as id',\n",
       "  'LOOKUP ON t1 WHERE t1.col1 <= 2 AND t1.col8 <= \"banana\" YIELD id(vertex) as id',\n",
       "  'LOOKUP ON e1 WHERE e1.col3 == false AND e1.col2 == 1.0 YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON any_shape YIELD ST_ASText(any_shape.geo)',\n",
       "  'LOOKUP ON like WHERE like.likeness == 666 YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 >= 1 AND e1.col5 >= time(\"11:11:11\") YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON player WHERE player.age > 30.5 YIELD id(vertex) as name, player.age AS Age',\n",
       "  'LOOKUP ON player WHERE player.age IN [40, 20] AND player.name > \"\" YIELD id(vertex) as id, player.age',\n",
       "  'LOOKUP ON player WHERE player.age == 40 YIELD player.name, player.age + 1',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 <= 2 AND e1.col5 < time(\"22:22:22\") YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 <= 2 AND e1.col3 <= true YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 == 1 AND e1.col3 == false YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON player\\nWHERE player.age IN [25,28]\\nYIELD properties(vertex).name, properties(vertex).age',\n",
       "  'LOOKUP ON like WHERE like.likeness == 888 YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON player WHERE player.name == \"Tony Parker\" YIELD id(vertex) as id',\n",
       "  'LOOKUP ON t1 WHERE t1.col1 == \"羊🐏\" YIELD id(vertex) as id',\n",
       "  'LOOKUP ON t1 WHERE t1.col4 == \"banana\" AND t1.col3 == true YIELD id(vertex) as id',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 >= 1 AND e1.col5 > time(\"11:11:11\") YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 >= 1 AND e1.col8 > \"apple\" YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON t1 WHERE t1.col1 <= 2 AND t1.col2 <= 2.0 YIELD id(vertex) as id',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 <= 2 AND e1.col3 < true YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON like WHERE like.grade == 666 YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON serve YIELD src(edge) as src, dst(edge) as dst, rank(edge) as rank',\n",
       "  'LOOKUP ON follow YIELD edge AS e|\\nYIELD COUNT(*) AS Follow_Number',\n",
       "  'LOOKUP ON t1 WHERE t1.col1 > \"aaaaa\" YIELD id(vertex) as id',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 == 1 AND e1.col5 == time(\"11:11:11\") YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON t1 WHERE t1.col4 == \"banana\" AND t1.col3 > true YIELD id(vertex) as id',\n",
       "  'LOOKUP ON like where like.likeness < 39 YIELD src(edge) as src, dst(edge) as dst, rank(edge) as rank',\n",
       "  'LOOKUP ON player WHERE player.age >= 29.5 YIELD id(vertex) as name, player.age AS Age',\n",
       "  'LOOKUP ON player WHERE player.age >= 40.0 YIELD id(vertex) as name, player.age AS Age',\n",
       "  'LOOKUP ON player WHERE player.name == \"Tony Parker\"\\nYIELD properties(vertex).name AS name, properties(vertex).age AS age',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 >= \"🐏羊羊\" YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON player WHERE player.age == 30 YIELD player.name, player.age + 1',\n",
       "  'LOOKUP ON t1 WHERE \"羊🐏羊\" < t1.col1 and t1.col1 < \"🐏羊\" YIELD id(vertex) as id',\n",
       "  'LOOKUP ON player WHERE player.name == \"Tony Parker\"\\nYIELD properties(vertex).name, properties(vertex).age',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 < \"abcde\" YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON e1 WHERE e1.col1 >= 1 AND e1.col3 >= false YIELD src(edge) as src, dst(edge) as dst',\n",
       "  'LOOKUP ON player\\nWHERE player.age < 32 and player.age >30\\nYIELD DISTINCT properties(vertex).age as v'],\n",
       " 'FIND': ['FIND ALL PATH WITH PROP FROM \"Yao Ming\" TO \"Danny Green\" OVER * BIDIRECT\\nWHERE like.likeness is  EMPTY OR like.likeness >= 80 AND 1 > 2 UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Tony Parker\", \"LaMarcus Aldridge\" OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND ALL PATH WITH PROP FROM \"Tony Parker\" TO \"Yao Ming\" OVER * BIDIRECT\\nWHERE  teammate.start_year > 2000 OR (like.likeness is not EMPTY AND like.likeness >= 80) UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH WITH PROP FROM \"team204\" TO \"player100\" OVER * REVERSELY YIELD path AS p',\n",
       "  'FIND SHORTEST PATH FROM \"Tim Duncan\", \"Tiago Splitter\" TO \"Tony Parker\", \"Spurs\" OVER like,serve UPTO 5 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like YIELD path as p\\n| YIELD nodes($-.p) AS nodes | UNWIND $-.nodes AS a | YIELD $-.a AS a',\n",
       "  'YIELD \"Shaquille O\\\\\\'Neal\" AS src\\n| FIND SHORTEST PATH FROM $-.src TO \"Manu Ginobili\" OVER * UPTO 5 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tiago Splitter\" TO \"LaMarcus Aldridge\" OVER like, teammate YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Yao Ming\"  TO \"Tony Parker\", \"Tracy McGrady\" OVER like,serve UPTO 5 STEPS YIELD path as p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like BIDIRECT UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"player102\" TO \"team204\" OVER * YIELD path AS p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Nobody\",\"Spur\" OVER like REVERSELY UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Nobody\", \"Spur\" OVER like REVERSELY UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"Tony Parker\", \"LaMarcus Aldridge\" OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH WITH PROP FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * BIDIRECT WHERE teammate.start_year is not EMPTY OR like.likeness > 90 UPTO 3 STEPS YIELD path as p |\\nYIELD distinct nodes($-.p) as nodes',\n",
       "  'FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"Tony Parker\", \"Spurs\" OVER like,serve UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND ALL PATH WITH PROP FROM \"Yao Ming\" TO \"Danny Green\" OVER * BIDIRECT\\nWHERE like.likeness is  EMPTY OR like.likeness >= 80 UPTO 3 STEPS YIELD path as p |\\nYIELD startnode($-.p) as startnode',\n",
       "  'FIND ALL PATH WITH PROP FROM \"Yao Ming\" TO \"Danny Green\" OVER * BIDIRECT\\nWHERE like.likeness is  EMPTY OR like.likeness >= 80 UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * REVERSELY YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"LaMarcus Aldridge\" OVER like YIELD path as p',\n",
       "  'FIND SHORTEST PATH WITH PROP FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * BIDIRECT WHERE teammate.start_year is not EMPTY OR like.likeness > 90 UPTO 3 STEPS YIELD path as p |\\nYIELD nodes($-.p) as nodes',\n",
       "  'FIND NOLOOP PATH FROM \"player100\" TO \"team204\" OVER * YIELD path AS p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Tony Parker\", \"Manu Ginobili\" OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tiago Splitter\" TO \"LaMarcus Aldridge\" OVER * YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tiago Splitter\" TO \"Tony Parker\" OVER * UPTO 1 STEPS YIELD path as p',\n",
       "  'YIELD \"Yao Ming\" AS src, \"Tony Parker\" AS dst\\n| FIND SHORTEST PATH FROM $-.src TO $-.dst OVER like, serve UPTO 5 STEPS YIELD path as p',\n",
       "  'FIND ALL PATH FROM \"Tim Duncan\" TO \"Tony Parker\", \"LaMarcus Aldridge\" OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like REVERSELY UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND ALL PATH WITH PROP FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like UPTO 3 STEPS YIELD path as p |\\nYIELD relationships($-.p) as relationships',\n",
       "  'FIND SHORTEST PATH FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * UPTO 5 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like YIELD path as p',\n",
       "  'FIND ALL PATH FROM \"Tim Duncan\" TO \"Nobody\", \"Spur\" OVER like REVERSELY UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND SHORTEST PATH FROM \"Shaquille O\\\\\\'Neal\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * UPTO 5 STEPS YIELD path as p',\n",
       "  'FIND ALL PATH WITH PROP FROM \"Tim Duncan\" TO \"Yao Ming\" OVER * BIDIRECT\\nWHERE (like.likeness >= 80 and like.likeness <= 90) OR (teammate.start_year is not EMPTY and teammate.start_year > 2001) UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND NOLOOP PATH FROM \"Tim Duncan\" TO \"Tony Parker\", \"Spurs\" OVER like,serve UPTO 3 STEPS YIELD path as p',\n",
       "  'FIND ALL PATH FROM \"player100\" TO \"team204\" OVER * WHERE follow.degree is EMPTY or follow.degree >=0 YIELD path AS p'],\n",
       " 'GET SUBGRAPH': [\"GET SUBGRAPH 4 steps from 'Tim Duncan' BOTH like YIELD vertices as a, edges as b\",\n",
       "  \"GET SUBGRAPH 4 steps from 'Tim Duncan' BOTH like YIELD VERTICES as nodes, EDGES as relationships\",\n",
       "  'GET SUBGRAPH 2 STEPS FROM \"Tim Duncan\" BOTH like YIELD edges as e\\n| UNWIND $-.e as a | YIELD $-.a AS a',\n",
       "  'GET SUBGRAPH 1 STEPS FROM \"player101\" YIELD VERTICES AS nodes, EDGES AS relationships',\n",
       "  'GET SUBGRAPH WITH PROP 1 STEPS FROM \"player101\" OUT serve YIELD VERTICES AS nodes, EDGES AS relationships',\n",
       "  \"GET SUBGRAPH WITH PROP 2 STEPS FROM 'Tim Duncan' IN like, serve YIELD EDGES as relationships\",\n",
       "  'GET SUBGRAPH 100 STEPS FROM \"player101\" OUT follow YIELD VERTICES AS nodes, EDGES AS relationships',\n",
       "  \"GET SUBGRAPH FROM 'Tim Duncan' OUT like  YIELD vertices as v\",\n",
       "  \"GET SUBGRAPH WITH PROP 2 STEPS FROM 'Tim Duncan' IN like, serve YIELD vertices as nodes, edges as relationships\",\n",
       "  \"GET SUBGRAPH WITH PROP 5 steps from 'Tony Parker' IN teammate OUT serve BOTH like YIELD VERTICES as nodes, EDGES as relationships\",\n",
       "  'GET SUBGRAPH WITH PROP 2 STEPS FROM \"player101\"\\nWHERE follow.degree > 90 AND $$.player.age > 30\\nYIELD VERTICES AS nodes, EDGES AS relationships',\n",
       "  \"$a = GET SUBGRAPH WITH PROP FROM 'Tim Duncan' | LIMIT 1\",\n",
       "  \"GET SUBGRAPH WITH PROP 2 STEPS FROM 'Tim Duncan'\\n  WHERE like.likeness > 95 AND like.likeness < 100\\n  YIELD vertices as nodes, edges as relationships\",\n",
       "  \"GET SUBGRAPH WITH PROP FROM 'Tim Duncan' | LIMIT 1\",\n",
       "  \"GET SUBGRAPH WITH PROP 2 STEPS FROM 'Tim Duncan' IN like OUT serve YIELD vertices as nodes, edges as relationships\",\n",
       "  'GET SUBGRAPH 1 STEPS FROM \"player101\" IN follow YIELD VERTICES AS nodes, EDGES AS relationships'],\n",
       " 'GO': [\"GO 1 STEPS FROM 'Tim Duncan' OVER like YIELD like._dst as id | GO FROM $-.id OVER serve YIELD serve._dst\",\n",
       "  \"GO FROM 'Tony Parker' OVER like\\nWHERE like._dst NOT IN ['Danny Green']\\nYIELD $$.player.name\",\n",
       "  'GO FROM \"Tim Duncan\" over like YIELD concat(like._src, $^.player.age, $$.player.name, like.likeness) AS A',\n",
       "  'GO FROM \"Paul Gasol\" OVER * YIELD like._dst, serve._dst, teammate._dst',\n",
       "  'GO 2 STEPS FROM \"player102\" OVER follow YIELD dst(edge)',\n",
       "  'GO FROM \"Grant Hill\" OVER like REVERSELY YIELD like._dst',\n",
       "  'GO FROM \"Dwight Howard\" OVER like, teammate REVERSELY YIELD like.likeness, teammate.start_year, $$.player.name',\n",
       "  'GO FROM \"player101\" OVER follow YIELD dst(edge) AS id |\\nGO FROM $-.id OVER serve YIELD properties($$).name AS Team,\\nproperties($^).name AS Player',\n",
       "  'GO FROM \"Tim Duncan\" OVER like LIMIT 1;',\n",
       "  'GO FROM \"player100\" OVER follow REVERSELY\\nYIELD src(edge) AS destination',\n",
       "  \"$var = GO FROM 'Tim Duncan', 'Chris Paul' OVER like YIELD $^.player.name AS name, id($$) AS id;\\nGO FROM $var.id OVER like  WHERE $var.name != $$.player.name YIELD $var.name, properties(edge) as props\",\n",
       "  \"GO 1 TO 2 STEPS FROM 'Tony Parker' OVER like YIELD DISTINCT like._dst, like.likeness, $$.player.name\",\n",
       "  'GO FROM \"Tony Parker\" OVER like REVERSELY YIELD like._dst',\n",
       "  \"GO FROM 'Russell Westbrook' OVER serve, like YIELD serve._dst, like._dst\",\n",
       "  'YIELD \"Tim Duncan\" as vid | GO FROM $-.vid OVER serve YIELD serve._dst',\n",
       "  'GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team | YIELD $-.team',\n",
       "  'GO FROM \"Kristaps Porzingis\" OVER like YIELD id($$) AS vid | RETURN $-.vid AS dst',\n",
       "  \"GO 1 TO 2 STEPS FROM 'Russell Westbrook' OVER * where properties($$).age > 20 YIELD $$ as dst\",\n",
       "  'GO FROM \"Russell Westbrook\" OVER serve, like  YIELD properties(edge) as props, type(edge) as type',\n",
       "  'GO FROM \"Tim Duncan\" OVER like YIELD like._dst AS dst, $$.player.age AS age\\n| YIELD $-.dst AS dst, 1+avg(distinct $-.age) AS age where $-.age > 40',\n",
       "  'GO FROM \"player100\" OVER follow\\nWHERE $^.player.age >= 42\\nYIELD dst(edge)',\n",
       "  'GO FROM \"Manu Ginobili\" OVER like, teammate REVERSELY WHERE $$.player.age > 30 and $$.player.age < 40\\nYIELD DISTINCT $$.player.age, $$.player.name',\n",
       "  \"GO FROM 'Tim Duncan' OVER like bidirect WHERE like.likeness > 90\\nYIELD $^.player.name, like._dst, $$.player.name, like.likeness\",\n",
       "  \"GO FROM 'Thunders' OVER serve REVERSELY YIELD $^ as src,tags($^), id($^), id($$), $$ as dst\",\n",
       "  \"GO 0 STEPS FROM 'Tim Duncan' OVER serve YIELD edge as e\",\n",
       "  '$var = GO FROM \"Tim Duncan\" OVER serve YIELD $^.player.name, serve.start_year, $$.team.name\\nUNION ALL\\nGO FROM \"Tony Parker\" OVER serve YIELD $^.player.name, serve.start_year, $$.team.name;\\nYIELD $var.*',\n",
       "  \"GO FROM 'Tim Duncan', 'Chris Paul' OVER like YIELD $^.player.name AS name, dst(edge) AS id |\\nGO FROM $-.id OVER like YIELD $-.name, dst(edge) as dst\",\n",
       "  '$var = GO FROM \"player100\" OVER follow YIELD dst(edge) AS id',\n",
       "  'GO FROM \\'Boris Diaw\\' OVER serve WHERE $$.team.name CONTAINS \"Haw\"\\nYIELD $^.player.name, serve.start_year, serve.end_year, $$.team.name',\n",
       "  'GO 1 TO 2 STEPS FROM \"player100\" OVER follow\\nYIELD dst(edge) AS destination',\n",
       "  'GO FROM \"Tim Duncan\" OVER serve YIELD $^.player.name, serve.start_year, $$.team.name\\nUNION ALL\\nGO FROM \"Tony Parker\" OVER like YIELD like._dst AS id |\\n   GO FROM $-.id OVER serve YIELD $^.player.name, serve.start_year, $$.team.name',\n",
       "  'GO 1000000000 TO 1000000002 STEPS FROM \"Tim Duncan\" OVER serve YIELD dst(edge) as dst, src(edge) as src',\n",
       "  'GO 1 STEPS FROM \"A\" OVER follow YIELD src(edge),dst(edge)',\n",
       "  'GO FROM \"player100\" OVER follow\\nYIELD dst(edge) AS dstid, properties($$).name AS Name |\\nGO FROM $-.dstid OVER follow YIELD dst(edge)',\n",
       "  'GO 10000000000000 STEPS FROM \"Tim Duncan\" OVER serve YIELD serve._dst;',\n",
       "  \"GO FROM 'Tim Duncan' OVER * YIELD dst(edge) as dst\",\n",
       "  'GO FROM \"player100\" OVER follow\\nYIELD properties($$).name AS Friend, properties($$).age AS Age',\n",
       "  '$var = GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team;YIELD $var.*',\n",
       "  'GO FROM \"player101\" OVER follow WHERE properties($$).age >= 35\\nYIELD properties($$).name AS Teammate, properties($$).age AS Age',\n",
       "  'GO FROM \"player102\" OVER follow YIELD dst(edge)\\nUNION ALL\\nGO FROM \"player100\" OVER follow YIELD dst(edge)',\n",
       "  'GO FROM \"James Harden\" OVER like YIELD like._dst',\n",
       "  'GO FROM \"Tim Duncan\" OVER serve YIELD serve._dst as id',\n",
       "  'GO FROM \"Tim Duncan\" OVER like YIELD like._dst AS dst, $$.player.age AS age\\n| YIELD DISTINCT count(*) AS count where $-.age > 40',\n",
       "  'GO 1 TO 2 STEPS FROM \"Tim Duncan\" OVER like WHERE like._dst != \"YAO MING\" YIELD dst(edge) AS vid\\n| GROUP BY $-.vid YIELD 1 AS id\\n| GROUP BY $-.id YIELD COUNT($-.id);',\n",
       "  'GO FROM \"Rajon Rondo\" OVER serve WHERE serve.start_year >= 2013 AND serve.end_year <= 2018\\nYIELD $^.player.name, serve.start_year, serve.end_year, $$.team.name',\n",
       "  '$var = GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team;YIELD $var.*, 123 as hash WHERE $var.start > 2005',\n",
       "  '$var = GO FROM \"player101\" OVER follow\\nYIELD src(edge) AS s, dst(edge) AS d',\n",
       "  '$a = GO FROM \"player100\" OVER follow YIELD src(edge) AS src, dst(edge) AS dst',\n",
       "  'GO FROM \"player102\" OVER follow YIELD dst(edge)\\nUNION\\nGO FROM \"player100\" OVER follow YIELD dst(edge)',\n",
       "  'GO 1 TO 10 STEPS FROM \"Tim Duncan\" OVER serve YIELD $$ as dst',\n",
       "  'GO FROM \"player100\" OVER follow\\nWHERE follow.degree > 90\\nYIELD dst(edge)',\n",
       "  'GO FROM \"Manu Ginobili\" OVER like, teammate REVERSELY WHERE like.likeness > 90\\nYIELD like.likeness, teammate.start_year, $$.player.name',\n",
       "  'GO FROM \"Steve Nash\" OVER like REVERSELY YIELD like._dst',\n",
       "  'GO FROM \"player101\" OVER follow BIDIRECT\\nYIELD properties($$).name AS Name\\n| GROUP BY $-.Name YIELD $-.Name, count(*)',\n",
       "  \"YIELD {a:1, b:['Tim Duncan', 'Tony Parker'], c:'Tim Duncan'} AS a\\n| YIELD $-.a.c AS b\\n| UNWIND $-.b AS c\\n| GO FROM $-.c OVER like YIELD edge AS e\",\n",
       "  'GO FROM \"player102\" OVER serve YIELD dst(edge)',\n",
       "  'GO FROM \"player100\" OVER follow YIELD dst(edge)\\nMINUS\\nGO FROM \"player102\" OVER follow YIELD dst(edge)',\n",
       "  'GO FROM \"player100\"\\nOVER follow\\nWHERE properties(edge).degree > 90\\nOR properties($$).age != 33\\nAND properties($$).name != \"Tony Parker\"\\nYIELD properties($$)',\n",
       "  'GO FROM \"1\"\\nOVER e1\\nWHERE rank(edge) > 2\\nYIELD src(edge), dst(edge), rank(edge) AS Rank, properties(edge).p1 |\\nORDER BY $-.Rank DESC',\n",
       "  \"GO FROM 'Tim Duncan' OVER serve bidirect YIELD serve._dst\",\n",
       "  '$var = GO FROM \"player101\" OVER follow YIELD dst(edge) AS id',\n",
       "  'GO FROM \"Russell Westbrook\" OVER * REVERSELY YIELD serve._dst, like._dst',\n",
       "  '$var = GO FROM \"Tim Duncan\", \"Chris Paul\" OVER like WHERE properties($$).age > 20 YIELD id($$) as id;\\nGO FROM $var.id OVER * WHERE properties(edge).likeness > 80 YIELD $$ as dst',\n",
       "  'GO FROM \"Tony Parker\" OVER like YIELD id($$) AS vid | RETURN $-.vid AS dst',\n",
       "  'GO FROM \"player100\"\\nOVER serve\\nYIELD properties(edge).start_year, properties(edge).end_year',\n",
       "  'GO FROM \"Chris Paul\" OVER like YIELD like._dst',\n",
       "  'GO 3 STEPS FROM \"Tim Duncan\" OVER like YIELD like._dst SAMPLE [1, 3, 2];',\n",
       "  \"GO 1 STEPS FROM 'Tony Parker' OVER like YIELD like._dst AS id\\n| GO 2 STEPS FROM $-.id OVER like YIELD like._dst\",\n",
       "  'GO FROM \"Russell Westbrook\" OVER like YIELD like._dst',\n",
       "  'GO FROM \"Tim Duncan\" OVER like WHERE [like._dst == \"Tony Parker\"]  LIMIT [1];',\n",
       "  'GO FROM \"LaMarcus Aldridge\" OVER * YIELD $$.team.name, $$.player.name',\n",
       "  '$var = GO FROM \"Tracy McGrady\" OVER like YIELD like._dst as id; GO FROM $var.id OVER like YIELD like._dst',\n",
       "  'GO 3 STEPS FROM \"player100\"\\nOVER *\\nYIELD properties($$).name AS NAME, properties($$).age AS Age\\nSAMPLE [1,2,3]',\n",
       "  \"GO FROM 'Russell Westbrook' OVER serve, like YIELD edge as e\",\n",
       "  \"GO 0 TO 2 STEPS FROM 'Tony Parker' OVER like BIDIRECT YIELD DISTINCT like._dst\",\n",
       "  'GO 1 TO 3 STEPS FROM \"player100\"\\nOVER *\\nYIELD properties($$).name AS NAME, properties($$).age AS Age\\nSAMPLE [2,2,2]',\n",
       "  'go 1 to 4 steps from \"Tim Duncan\" over like yield like.likeness, edge as e',\n",
       "  'GO 2 STEPS FROM \"Tim Duncan\" OVER like YIELD like._dst AS dst | YIELD DISTINCT $-.dst AS dst',\n",
       "  '$var1 = GO FROM \"player101\" OVER follow\\nYIELD properties(edge).degree AS Degree, dst(edge) as ID',\n",
       "  'GO FROM \"player101\" OVER follow YIELD id($$)',\n",
       "  'GO FROM \"Paul George\" OVER like YIELD like._dst',\n",
       "  'GO FROM \"Manu Ginobili\" OVER * REVERSELY YIELD like.likeness, teammate.start_year, serve.start_year, $$.player.name',\n",
       "  \"GO FROM 'Tony Parker' OVER like\\nWHERE like.likeness NOT IN {95,56,21}\\nYIELD $$.player.name, like.likeness\",\n",
       "  \"GO FROM 'Tony Parker' OVER like\\nWHERE like._dst NOT IN {'Danny Green'}\\nYIELD $$.player.name\",\n",
       "  \"GO FROM 'Carmelo Anthony', 'Dwyane Wade' OVER like\\n   YIELD $$.player.name AS name\\n   | GROUP BY $-.name\\n     YIELD $-.name AS name,\\n           SUM(1.5) AS sum,\\n           COUNT(*) AS count\\n      | ORDER BY $-.sum, $-.name  DESC\\n      | LIMIT 2\",\n",
       "  'GO FROM \"Boris Diaw\" OVER like YIELD like._dst',\n",
       "  'GO FROM \"player100\" OVER follow YIELD dst(edge) AS id |\\nGO FROM $-.id OVER serve YIELD properties($$).name AS Team,\\nproperties($^).name AS Player',\n",
       "  'GO FROM \"Nobody\" OVER like YIELD like._dst | YIELD 1',\n",
       "  'GO FROM \"player666\", \"player667\", \"player668\"\\nOVER serve\\nYIELD properties(edge).start_year, properties(edge).end_year',\n",
       "  \"GO FROM 'Tim Duncan' OVER like bidirect YIELD edge as e\",\n",
       "  'GO 10000000000000 STEPS FROM \"Tim Duncan\" OVER serve YIELD dst(edge) as dst',\n",
       "  'GO FROM \"Tim Duncan\" OVER like YIELD like._dst',\n",
       "  \"GO FROM 'Tim Duncan' OVER like WHERE properties($$).age > 38 YIELD edge as e,  $$ as dst\",\n",
       "  \"$A = GO FROM 'Tony Parker' OVER like YIELD like._dst AS ID;\\nGO FROM $A.ID OVER like WHERE like.likeness NOT IN [95,56,21]\\nYIELD $^.player.name, $$.player.name, like.likeness\",\n",
       "  'GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name, serve.start_year, serve.end_year, $$.team.name',\n",
       "  \"GO 0 TO 2 STEPS FROM 'Tony Parker' OVER like YIELD DISTINCT dst(edge) as dst, edge as e, $$.player.name, $^.player.age, like.likeness\",\n",
       "  \"GO FROM 'Tim Duncan' OVER serve, like bidirect YIELD distinct dst(edge) as dst\",\n",
       "  'GO FROM \"Tracy McGrady\" OVER like YIELD like._dst',\n",
       "  'GO FROM \"player100\" OVER follow, serve\\nYIELD properties(edge).degree, properties(edge).start_year',\n",
       "  \"GO FROM 'Tim Duncan' OVER like YIELD like._src as src, like._dst as dst |\\nGO 1 TO 2 STEPS FROM $-.src OVER like YIELD $-.src as src, $-.dst, like._dst as dst, edge as e\",\n",
       "  'GO FROM \"player100\" OVER * WHERE properties($$).name IS NOT EMPTY YIELD dst(edge)',\n",
       "  'GO FROM \"Russell Westbrook\" OVER * REVERSELY YIELD serve._src, like._src',\n",
       "  \"$a = GO FROM 'Danny Green' OVER like YIELD like._src AS src, like._dst AS dst;\\nGO FROM $a.dst OVER teammate YIELD $a.src AS src, $a.dst, teammate._dst AS dst\",\n",
       "  'GO FROM \"player100\" OVER follow YIELD properties($^).age AS SrcAge, properties($$).age AS DestAge',\n",
       "  'GO 1 STEPS FROM \"Boris Diaw\" OVER serve\\nWHERE $^.player.age > 18\\nYIELD serve.start_year as start_year',\n",
       "  'GO FROM \"Russell Westbrook\" OVER * REVERSELY YIELD like._dst, serve._dst, teammate._dst',\n",
       "  '$var = GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team;YIELD $var.team',\n",
       "  'GO FROM \"Carmelo Anthony\" OVER like YIELD like._dst| YIELD COUNT(*)',\n",
       "  \"GO FROM 'Tony Parker' OVER like\\nWHERE like.likeness NOT IN [95,56,21]\\nYIELD $$.player.name, like.likeness\",\n",
       "  'GO 3 STEPS FROM \"Tim Duncan\" OVER like,serve\\n  WHERE size(labels($$))>0 AND $$.player.age>40\\n  yield $$ as v',\n",
       "  'GO FROM \"player100\" OVER follow\\nYIELD dst(edge) AS id |\\nGO FROM $-.id OVER serve\\nYIELD properties($^).name AS Player, properties($$).name AS Team',\n",
       "  \"GO 1 TO 2 STEPS FROM 'Russell Westbrook' OVER * YIELD serve._dst, like._dst\",\n",
       "  \"GO 2 STEPS FROM 'Kobe Bryant' OVER like REVERSELY YIELD $$.player.name\",\n",
       "  'GO FROM \"Tony Parker\" OVER like YIELD like._dst',\n",
       "  'GO 10 STEPS FROM \"Tim Duncan\" OVER serve YIELD $$ as dst',\n",
       "  'GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team | YIELD $-.*',\n",
       "  'GO FROM \"Tim Duncan\" OVER like YIELD like._dst AS dst | YIELD DISTINCT $-.dst AS dst',\n",
       "  'GO FROM \"player102\" OVER follow\\nYIELD dst(edge) AS id, properties(edge).degree AS Degree, properties($$).age AS Age\\nUNION /* DISTINCT */\\nGO FROM \"player100\" OVER follow\\nYIELD dst(edge) AS id, properties(edge).degree AS Degree, properties($$).age AS Age',\n",
       "  '$v1 = GO FROM \"Tony Parker\" OVER like YIELD id($$) AS dst, $^.player.age AS age',\n",
       "  'GO FROM \"player100\" OVER follow WHERE properties($$).name IS NOT EMPTY YIELD dst(edge)',\n",
       "  'GO FROM \"Tim Duncan\" OVER like, serve\\n  WHERE serve.start_year > 1970 OR properties($$).age < 50\\n  YIELD $$ AS dst, edge AS e',\n",
       "  'GO FROM \"player102\" OVER follow\\nYIELD dst(edge) AS id, properties(edge).degree AS Degree, properties($$).age AS Age\\nINTERSECT\\nGO FROM \"player100\" OVER follow\\nYIELD dst(edge) AS id, properties(edge).degree AS Degree, properties($$).age AS Age',\n",
       "  '$var = GO FROM \"player100\" OVER follow\\nYIELD dst(edge) AS dst',\n",
       "  'GO 3 STEPS FROM \"Tim Duncan\" OVER like LIMIT [1, 2, 2];',\n",
       "  'GO 2 STEPS FROM \"Tim Duncan\" OVER serve YIELD edge as e',\n",
       "  'GO FROM \"player100\" OVER follow YIELD $^.player.name AS startName, $$.player.age AS endAge',\n",
       "  '(GO FROM \"Tim Duncan\" OVER like YIELD like._dst as id |\\n   GO FROM $-.id OVER serve YIELD $^.player.name, serve.start_year, $$.team.name)\\nUNION DISTINCT\\nGO FROM \"Tony Parker\" OVER serve YIELD $^.player.name, serve.start_year, $$.team.name'],\n",
       " 'SHOW': [],\n",
       " 'MIXED': ['GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst\\n| FIND NOLOOP PATH FROM $-.src TO $-.dst OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  '$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\\nFIND NOLOOP PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p |\\nORDER BY $-.p | LIMIT 5',\n",
       "  \"FETCH PROP ON player 'Tony Parker' YIELD player.name as Name |\\nGO FROM $-.Name OVER like YIELD like._dst\",\n",
       "  '$a = GO FROM \"Yao Ming\" over like YIELD like._dst AS src;\\nFIND SHORTEST PATH FROM $a.src TO \"Tony Parker\" OVER like, serve UPTO 5 STEPS YIELD path as p',\n",
       "  'GO FROM \"player100\" OVER follow\\nYIELD dst(edge) AS ID\\n| FETCH PROP ON player $-.ID\\nYIELD properties(vertex).age AS Age\\n| YIELD AVG($-.Age) as Avg_age, count(*)as Num_friends',\n",
       "  'INSERT EDGE like(likeness) VALUES \"Tim Duncan\"->\"Tim Parker\":(99);\\nINSERT EDGE like(likeness) VALUES \"Tim Parker\"->\"Tony Parker\":(90);',\n",
       "  \"LOOKUP ON player\\nWHERE player.name CONTAINS 'Tim'\\nYIELD player.age as age, id(vertex) as vid |\\nGO FROM $-.vid OVER like REVERSELY YIELD $-.age AS age, like._dst AS dst |\\nYIELD\\n  any(d IN COLLECT(DISTINCT $-.dst) WHERE d=='Tony Parker') AS d,\\n  $-.age as age\",\n",
       "  'GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst\\n| FIND SHORTEST PATH FROM $-.src TO $-.dst OVER like UPTO 5 STEPS YIELD path as p',\n",
       "  '$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\\nFIND ALL PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  \"$var = LOOKUP ON player\\nWHERE player.name CONTAINS 'Tim'\\nYIELD player.age AS age, id(vertex) AS vid;\\nGO FROM $var.vid\\nOVER like REVERSELY\\nYIELD\\n  $var.age AS age,\\n  ('Tony Parker' == like._dst) AS liked,\\n  like._src AS src,\\n  like._dst AS dst\",\n",
       "  \"$var = GO FROM 'Boris Diaw','Boris Diaw' OVER serve YIELD serve._src AS src, serve._dst AS dst;\\nFETCH PROP ON serve $var.src->$var.dst YIELD DISTINCT serve.start_year, serve.end_year, edge as relationship\",\n",
       "  '$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\\nFIND NOLOOP PATH WITH PROP FROM $a.src TO $a.dst OVER like WHERE like.likeness > 90 UPTO 3 STEPS YIELD path as p |\\nORDER BY $-.p | LIMIT 5',\n",
       "  'GO FROM \"player101\" OVER follow\\nYIELD src(edge) AS s, dst(edge) AS d\\n| FETCH PROP ON follow $-.s -> $-.d\\nYIELD properties(edge).degree',\n",
       "  '$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\\nFIND NOLOOP PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  'GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst |\\nFIND SHORTEST PATH FROM $-.src TO $-.dst OVER like UPTO 5 STEPS YIELD path as p |\\nORDER BY $-.p | LIMIT 10',\n",
       "  '$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\\nFIND ALL PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p |\\nORDER BY $-.p | LIMIT 5',\n",
       "  \"GO from 'Tim Duncan' OVER serve YIELD serve._src AS id |\\nGET SUBGRAPH WITH PROP FROM $-.id\\nYIELD vertices as nodes, edges as relationships\",\n",
       "  'LOOKUP ON player WHERE player.age == 40 YIELD id(vertex) as id |\\nFETCH PROP ON player $-.id YIELD player.name',\n",
       "  'LOOKUP ON player WHERE player.age == 40 YIELD player.name AS name |\\nGO 1 TO 2 STEPS FROM $-.name OVER like REVERSELY YIELD like._dst AS dst, $$.player.name AS name, edge as e, $$ as dstnode, $^ as srcnode',\n",
       "  \"LOOKUP ON player\\nWHERE player.name CONTAINS 'Tim'\\nYIELD player.age AS age, id(vertex) AS vid |\\nGO FROM $-.vid\\nOVER like REVERSELY\\nYIELD\\n  $-.age AS age,\\n  ('Tony Parker' == like._dst) AS liked,\\n  like._src AS src,\\n  like._dst AS dst\",\n",
       "  'GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst |\\nFIND ALL PATH FROM $-.src TO $-.dst OVER like UPTO 3 STEPS YIELD path as p',\n",
       "  '$a = LOOKUP ON player WHERE player.age == 40 YIELD id(vertex) as id;\\nFETCH PROP ON player $a.id YIELD player.name'],\n",
       " 'QUICK_RETURN': [],\n",
       " 'OTHER': []}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "class_dict_nba = nGQL_classify( unique_list_nba )\n",
    "class_dict_nba"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict_keys(['INSERT', 'OTHER_WRITE', 'MATCH', 'FETCH PROP ON', 'LOOKUP ON', 'FIND', 'GET SUBGRAPH', 'GO', 'SHOW', 'MIXED', 'QUICK_RETURN', 'OTHER'])"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "class_dict_nba.keys()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_nl_from_gql( gql ):\n",
    "    for i in range(len(test_pair)):\n",
    "        if gql == test_pair[i][\"查询\"]:\n",
    "            return test_pair[i][\"用户\"]\n",
    "    for i in range(len(train_pair)):\n",
    "        if gql == train_pair[i][\"查询\"]:\n",
    "            return train_pair[i][\"用户\"]\n",
    "    return \"没找到\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 抽取意图"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "597"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "os.chdir( \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/methods/MyMethod/N3/intentions\")\n",
    "from query_parser_Cypher import parse_match_query\n",
    "from type_stat import nGQL_classify, get_intention\n",
    "from query_parser_nGQL import (\n",
    "    split_ngql, parser_yield, parser_where, parse_lookup_query, \n",
    "    parse_fetch_query, parse_find_query, parse_subgraph_query, parse_write_query,\n",
    "    parse_go_query, parse_mixed_to_standard\n",
    ")\n",
    "\n",
    "from query_parser_standard import (\n",
    "    get_standard_list, parse_fetch_to_standard, parse_look_to_standard, parse_find_to_standard,\n",
    "    parse_subgraph_to_standard, parse_go_to_standard, parse_wirte_other_to_standard\n",
    ")\n",
    "\n",
    "def count_parsed_number( parsed_dict ):\n",
    "    count = 0\n",
    "    for key in parsed_dict:\n",
    "        count += len(parsed_dict[key])\n",
    "    return count\n",
    "\n",
    "# dict_keys(['INSERT', 'OTHER_WRITE', 'MATCH', 'FETCH PROP ON', 'LOOKUP ON',\n",
    "#  'FIND', 'GET SUBGRAPH', 'GO', 'SHOW', 'MIXED', 'QUICK_RETURN', 'OTHER'])\n",
    "\n",
    "from query_parser_standard import parse_intention\n",
    "parsed_dict, query_dict = parse_intention(class_dict_nba )\n",
    "count_parsed_number( parsed_dict )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 形成意图字典"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "path = \"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/methods/MyMethod/N3/intentions/intention_extract\"\n",
    "\n",
    "all_dict = {}\n",
    "for part_ in [\"disease\", \"nba\", \"potter\", \"other\"]:\n",
    "    sub_dir = os.path.join( path, part_)\n",
    "    files = os.listdir(sub_dir)\n",
    "    for file in files:\n",
    "        if \"intention_list.json\" in file:\n",
    "            try:\n",
    "                intention_list = load_data( os.path.join(sub_dir,  file), \"json\")\n",
    "            except:\n",
    "                raise Exception( f\"加载失败{os.path.join(sub_dir,  file)}\")\n",
    "            query_list = load_data( os.path.join(sub_dir,  file).replace(\"intention_list\", \"query_list\"), \"json\")\n",
    "            if len( intention_list) != len(query_list):\n",
    "                raise Exception( f\"长度不一致{os.path.join(sub_dir,  file)} {len( intention_list), len(query_list)}\")\n",
    "            for i in range(len(query_list)):\n",
    "                query = query_list[i]\n",
    "                '''if query in all_dict:\n",
    "                    raise Exception( f\"已存在键{os.path.join(sub_dir,  file)} {query}\")'''\n",
    "                all_dict[query] = intention_list[i]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1254\n",
      "3862\n"
     ]
    }
   ],
   "source": [
    "for lists, part in zip( [tests, trains], [\"test\", \"train\"]):\n",
    "    ret_list = []\n",
    "    save_path = f\"/home/jiangpeiwen2/jiangpeiwen2/NL2GQL/methods/MyMethod/N3/intentions/intention_extract/intentions_label_{part}.json\"\n",
    "    for i in range(len(lists)):\n",
    "        query = lists[i]['content']\n",
    "        if query not in all_dict:\n",
    "            raise Exception( f\"不存在键{part} {query}\")\n",
    "        ret_list.append( all_dict[query])\n",
    "    print(len(ret_list))\n",
    "    save_data( ret_list, save_path)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "n3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
