[
    {
        "ç”¨æˆ·": "Can you help me find the IDs of all entities that have a 'service' relationship with 'Tim Duncan'?",
        "æŸ¥è¯¢": "GO FROM 'Tim Duncan' OVER serve bidirect YIELD serve._dst"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find out the starting and ending years of 'Boris Diaw' in 'Hawks'?",
        "æŸ¥è¯¢": "FETCH PROP ON serve 'Boris Diaw' -> 'Hawks' YIELD serve.start_year, serve.end_year"
    },
    {
        "ç”¨æˆ·": "å¾—äº†ç³–å°¿ç—…æ¨èåƒä»€ä¹ˆï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'ç³–å°¿ç—…'})-[e:recommend_eat]->(n1:food) return n1.food.name"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the start and end years of the 'serve' relationship between 'Tony Parker' and 'Spurs'?",
        "æŸ¥è¯¢": "FETCH PROP ON serve \"Tony Parker\"->\"Spurs\" YIELD serve.start_year, serve.end_year"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me search for player.name and player.age in all the attributes of 'Boris Diaw'?",
        "æŸ¥è¯¢": "YIELD 'Boris Diaw' as id | FETCH PROP ON * $-.id yield player.name, player.age"
    },
    {
        "ç”¨æˆ·": "Can you help me delete the status of the edge index?",
        "æŸ¥è¯¢": "DROP EDGE INDEX edge_index_status"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the name and age attributes of a player named 'Grant Hill'?",
        "æŸ¥è¯¢": "FETCH PROP ON player \"Grant Hill\" YIELD player.name, player.age"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the points related to 'Tim Duncan'? The weight of the 'like' relationship between these points is 90, and the path length is 2 or 3. Can you provide me with information about these edges and endpoints?",
        "æŸ¥è¯¢": "MATCH (n)-[e:like*2..3{likeness: 90}]-(v)\nWHERE id(n) == \"Tim Duncan\"\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Hello, could you help me find a statement to create an edge type called work2?",
        "æŸ¥è¯¢": "SHOW CREATE EDGE work2;"
    }
]