[
    {
        "ç”¨æˆ·": "Could you please insert a player named 'Tony Parker' and aged 36 into the player type set with ID 'player101'?",
        "æŸ¥è¯¢": "INSERT VERTEX player(name, age) VALUES \"player101\":(\"Tony Parker\", 36)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåä¸º'Tim Duncan'çš„çƒå‘˜æ‰€è¿æ¥çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶æŒ‰ç…§å¹´é¾„é™åºæ’åˆ—ï¼Œè·³è¿‡ç¬¬ä¸€ä¸ªç»“æœï¼Œè¿”å›å®ä½“çš„å§“åå’Œå¹´é¾„ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\nRETURN v2.player.name AS Name, v2.player.age AS Age\nORDER BY Age DESC SKIP 1"
    },
    {
        "ç”¨æˆ·": "Please help me find all entities associated with a player named 'Tim Duncan' and sort them in descending order of age, skip the first result, and then tell me the name and age of the oldest entity.",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\nRETURN v2.player.name AS Name, v2.player.age AS Age\nORDER BY Age DESC SKIP 1 LIMIT 1"
    },
    {
        "ç”¨æˆ·": "Starting from 'Tim Duncan', take three steps along the 'like' relationship, and return to the result limit where the first hop automatically selects 1 edge, the second hop selects 3 edges, and the third hop selects 2 edges",
        "æŸ¥è¯¢": "GO 3 STEPS FROM \"Tim Duncan\" OVER like YIELD like._dst SAMPLE [1, 3, 2];"
    },
    {
        "ç”¨æˆ·": "è¯·æ‰¾å‡ºæ‰€æœ‰å…³æ³¨'player100'çš„å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„è¾¹çš„æºèŠ‚ç‚¹ä½œä¸ºdestinationã€‚",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow REVERSELY\nYIELD src(edge) AS destination"
    },
    {
        "ç”¨æˆ·": "Find the IDs of all entities that 'Tony Parker' likes' and return the IDs of these entities and the age of 'Tony Parker'.",
        "æŸ¥è¯¢": "$v1 = GO FROM \"Tony Parker\" OVER like YIELD id($$) AS dst, $^.player.age AS age"
    },
    {
        "ç”¨æˆ·": "æŸ¥è¯¢æ‰€æœ‰çƒå‘˜èŠ‚ç‚¹çš„IDã€æ•°é‡ã€å¹´é¾„æ€»å’Œã€æœ€å¤§å¹´é¾„ã€æœ€å°å¹´é¾„ã€å¹³å‡å¹´é¾„å’Œæ ‡ç­¾ï¼Œå¹¶æŒ‰ç…§IDã€æ•°é‡ã€æœ€å¤§å¹´é¾„ã€æœ€å°å¹´é¾„æ’åºï¼Œè·³è¿‡å‰10ä¸ªç»“æœï¼Œè¿”å›æ¥ä¸‹æ¥çš„8ä¸ªç»“æœã€‚",
        "æŸ¥è¯¢": "MATCH(n:player)\n  RETURN id(n) AS id,\n         count(n) AS count,\n         sum(floor(n.player.age)) AS sum,\n         max(n.player.age) AS max,\n         min(n.player.age) AS min,\n         avg(distinct n.player.age)+1 AS age,\n         labels(n) AS lb\n    ORDER BY id, count, max, min\n    SKIP 10 LIMIT 8;"
    },
    {
        "ç”¨æˆ·": "Find the relationships between a player named 'Tracy McGrady' and entities with a 90 degree of service or liking, and return these relationships and entities.",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1{likeness: 90}]->(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Please identify all entities that 'player100' with a focus greater than 90 and return the edge information of these entities.",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow\nWHERE follow.degree > 90\nYIELD dst(edge)"
    },
    {
        "ç”¨æˆ·": "Find a player named 'Tim Duncan' and find another player who has a relationship with a certain entity, and return the names of these players.",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"})-->()<--(v3)\nRETURN v3.player.name AS Name"
    },
    {
        "ç”¨æˆ·": "å¯»æ‰¾åä¸º'Tim Duncan'çš„çƒå‘˜çš„æ‰€æœ‰æœ‹å‹ï¼Œä»–ä»¬ä¹‹é—´çš„å…³ç³»ä¸ºä¸¤è·³'follow'ï¼Œå¹¶ä¸”å…³ç³»çš„åº¦å¤§äº1ï¼Œè¿”å›è¿™äº›æœ‹å‹çš„å§“åã€‚",
        "æŸ¥è¯¢": "MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\nWHERE e.degree > 1\nRETURN DISTINCT v2 AS Friends"
    },
    {
        "ç”¨æˆ·": "æ‚¨å¥½ï¼Œè¯·å¸®æˆ‘æ‰¾åˆ°'Boris Diaw'æ‰€æœåŠ¡çš„æ‰€æœ‰å®ä½“ï¼Œç„¶åå‘Šè¯‰æˆ‘å®ƒä»¬çš„åç§°ã€å¼€å§‹å¹´ä»½å’Œæ‰€å±å›¢é˜Ÿåç§°å¥½å—ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team | YIELD $-.*"
    },
    {
        "ç”¨æˆ·": "Hello, could you help me find the ID of a student entity with the alias' abc '?",
        "æŸ¥è¯¢": "LOOKUP ON student WHERE student.alias == \"abc\" YIELD id(vertex) as id"
    },
    {
        "ç”¨æˆ·": "æŸ¥æ‰¾ä¸çƒå‘˜ 'Manu Ginobili' æœ‰2åˆ°3è·³ 'å–œæ¬¢' å…³ç³»çš„å®ä½“ï¼Œè¿”å›è¿™äº›å®ä½“çš„æ€§åˆ«ã€å…³ç³»å¼ºåº¦ã€å§“åã€å¹´é¾„å’Œå…³ç³»å¼€å§‹å¹´ä»½ï¼Œå¹¶æŒ‰ç…§å…³ç³»å¼ºåº¦ã€å§“åã€å¹´é¾„æ’åºï¼Œæœ€å¤šè¿”å›5æ¡è®°å½•ã€‚",
        "æŸ¥è¯¢": "match (src_v:player{name:\"Manu Ginobili\"})-[e:like*2..3]-(dst_v)\n  return distinct properties(src_v).sex,properties(e[0]).degree as degree,properties(dst_v).name as name,src_v.player.age AS age, e[1].start_year,dst_v.player.age\n  order by degree, name, age limit 5;"
    },
    {
        "ç”¨æˆ·": "Please help me find all relevant entities for a player named 'Tim Duncan', but the entity is not a team type and return these path information.",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"})-[e]->(t)\nWHERE NOT (v)-[e]->(t:team)\nRETURN (v)-->()"
    },
    {
        "ç”¨æˆ·": "Can you help me find all relevant entities and their attributes?",
        "æŸ¥è¯¢": "MATCH () -[]-> (v) RETURN *"
    },
    {
        "ç”¨æˆ·": "å¾—äº†å¿ƒè„ç—…éœ€è¦åƒä»€ä¹ˆè¯ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"å¿ƒè„ç—…\" OVER recommend_drug YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Find all favorite entities and their relationships for a player named 'Tracy McGrady' with a distance of 0 to 1.",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tracy McGrady\"})-[e:like*0..1]-(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Can you help me find the entity with ID 'Boris Diaw'?",
        "æŸ¥è¯¢": "MATCH (v) WHERE id(v) == 'Boris Diaw' RETURN (v)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Tim Duncan' å’Œ 'Tony Parker' æ‰€æœåŠ¡è¿‡çš„çƒé˜Ÿ,åˆå¹¶ç»“æœï¼Œå¹¶è¿”å›èµ·ç‚¹å§“åï¼ŒæœåŠ¡å¼€å§‹å¹´ä»½å’Œç»ˆç‚¹é˜Ÿåã€‚",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" OVER serve YIELD $^.player.name, serve.start_year, $$.team.name\nUNION ALL\nGO FROM \"Tony Parker\" OVER like YIELD like._dst AS id |\n   GO FROM $-.id OVER serve YIELD $^.player.name, serve.start_year, $$.team.name"
    },
    {
        "ç”¨æˆ·": "Find all the teams served by 'Boris Diaw' and return four values, including the name of the starting node, the starting time of the service relationship, the name of the ending team, and the team.",
        "æŸ¥è¯¢": "$var = GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team;YIELD $var.team"
    },
    {
        "ç”¨æˆ·": "Hello, I would like to ask for your help in finding any entity from 'Tony Parker' or 'Yao Ming' to 'Manu Ginobili', 'Spurs', or' Lakes'. The shortest path can contain up to 5 steps. Can you return the path information to me?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * UPTO 5 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Find the first 'Tony Parker' entity that Tim Duncan likes.",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" OVER like WHERE [like._dst == \"Tony Parker\"]  LIMIT [1];"
    },
    {
        "ç”¨æˆ·": "Please find the entity connected through the 'follow' relationship starting from 'player100' and tell me the name of the starting entity and the age of the ending entity.",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow YIELD $^.player.name AS startName, $$.player.age AS endAge"
    },
    {
        "ç”¨æˆ·": "Please help me find all the friends who have been following me twice for a player named 'Tim Duncan' and tell me the names of these friends.",
        "æŸ¥è¯¢": "MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\nRETURN DISTINCT v2 AS Friends"
    },
    {
        "ç”¨æˆ·": "Can you help me identify all entities and relationships that have a 2-3 hop 'serve' relationship with 'Tim Duncan'?",
        "æŸ¥è¯¢": "MATCH (n)-[e:serve*2..3]->(v)\nWHERE id(n) == \"Tim Duncan\"\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find the entities and their relationship types related to 'LeBron James' and return the entity name or' abc '.",
        "æŸ¥è¯¢": "MATCH (v1:player{name: \"LeBron James\"}) -[r]-> (v2)\nRETURN type(r) AS Type, CASE WHEN v2.tea.name IS NOT NULL THEN v2.tea.name WHEN v2.playe.name IS NOT NULL THEN v2.playe.name ELSE \"abc\" END AS Name"
    },
    {
        "ç”¨æˆ·": "Find all entities that 'player101' is interested in and return their IDs.",
        "æŸ¥è¯¢": "GO FROM \"player101\" OVER follow YIELD id($$)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåœ¨2000å¹´ä¹‹å‰å¼€å§‹å‚åŠ é˜Ÿä¼çš„æ‰€æœ‰çƒå‘˜çš„å§“åå’Œå¹´é¾„ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player)-[e]->()\nWHERE e.start_year < 2000\nRETURN DISTINCT v.player.name, v.player.age"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºæ‰€æœ‰ä»¥å­—æ¯'r'ç»“å°¾çš„çƒå‘˜çš„å§“åå’Œå¹´é¾„ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player)\nWHERE v.player.name ENDS WITH \"r\"\nRETURN v.player.name, v.player.age"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåä¸º'Tim Duncan'çš„çƒå‘˜æ‰€å…³æ³¨æˆ–æ•ˆåŠ›çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“ã€‚",
        "æŸ¥è¯¢": "MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow|serve*2]->(v2)\nRETURN DISTINCT v2"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºå¹´é¾„å¤§äº45å²çš„çƒå‘˜ä¸æ´›æ‰çŸ¶æ¹–äººé˜Ÿæœ‰æœåŠ¡å…³ç³»çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„å§“åã€'hello'ã€å–œæ¬¢ç¨‹åº¦å’Œæ‰€å±çƒé˜Ÿåç§°ï¼Œç”¨'@'ç»„åˆå§“åå’Œæ‰€å±çƒé˜Ÿåç§°ã€‚",
        "æŸ¥è¯¢": "MATCH (a:player)-[b:serve]-(c:team{name: \"Lakers\"})\nWHERE a.player.age > 45\nRETURN concat_ws(\"@\",a.player.name, NULL, \"hello\", b.likeness, c.team.name) as result"
    },
    {
        "ç”¨æˆ·": "è¯·æ‰¾å‡ºä»¥'player100'ä¸ºèµ·ç‚¹ï¼Œé€šè¿‡'follow'å…³ç³»ï¼Œä¸”è¾¹çš„å±æ€§ä¸­çš„åº¦æ•°å¤§äº90æˆ–è€…ç»ˆç‚¹å®ä½“çš„å¹´é¾„ä¸ç­‰äº33ä¸”åå­—ä¸ç­‰äº'Tony Parker'çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„å±æ€§ã€‚",
        "æŸ¥è¯¢": "GO FROM \"player100\"\nOVER follow\nWHERE properties(edge).degree > 90\nOR properties($$).age != 33\nAND properties($$).name != \"Tony Parker\"\nYIELD properties($$)"
    },
    {
        "ç”¨æˆ·": "May I ask if you know what time it is now?",
        "æŸ¥è¯¢": "RETURN datetime().hour"
    },
    {
        "ç”¨æˆ·": "Can you help me obtain all the attributes of the entity 'Boris Diaw' and return its ID?",
        "æŸ¥è¯¢": "FETCH PROP ON * 'Boris Diaw' YIELD id(vertex)"
    },
    {
        "ç”¨æˆ·": "Identify all entities over the age of 30 that have any relationship with player 'Tim Duncan' and return the relationship paths of these entities, up to a maximum of 100.",
        "æŸ¥è¯¢": "MATCH p=(v:player)-[]->(n)\nWHERE id(v)==\"Tim Duncan\" and n.player.age>30\nRETURN p LIMIT 100"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the team name and relationship type related to 'LeBron James'?",
        "æŸ¥è¯¢": "MATCH (v1) -[r:serve]-> (v2)\nWHERE id(v1) == \"LeBron James\"\nRETURN type(r) AS Type, v2.team.name AS Name"
    },
    {
        "ç”¨æˆ·": "Please find a player node named 'Tim Duncan' and all its related nodes.",
        "æŸ¥è¯¢": "MATCH p=(v:player{name:\"Tim Duncan\"})-->(v2)\nRETURN nodes(p)"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡ºåä¸º'Tim Duncan'çš„çƒå‘˜ä¸å…¶æ‰€å±çš„çƒé˜Ÿä¹‹é—´çš„å…³ç³»ï¼Œå¹¶å°†çƒå‘˜ä¸çƒé˜Ÿä¹‹é—´çš„æ‰€æœ‰è¿æ¥å…³ç³»è¿”å›ç»™æˆ‘ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"})-[e]->(t)\nWHERE (v)-[e]->(t:team)\nRETURN (v)-->()"
    },
    {
        "ç”¨æˆ·": "å¾—äº†è‚ºç‚éœ€è¦åšå“ªäº›æ£€æŸ¥ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'è‚ºç‚'})-[e:need_check]->(n1:check) return n1.check.name"
    },
    {
        "ç”¨æˆ·": "å¾—äº†é«˜è¡€å‹æ¨èåƒä»€ä¹ˆè¯ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é«˜è¡€å‹\" OVER recommend_drug YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Please identify all entities one step away from entity 'A' and return the source and target nodes of these entities to me.",
        "æŸ¥è¯¢": "GO 1 STEPS FROM \"A\" OVER follow YIELD src(edge),dst(edge)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåä¸ºTracy McGradyçš„çƒå‘˜åœ¨2000å¹´ä¹‹åæ‰€æ•ˆåŠ›è¿‡æˆ–å–œæ¬¢è¿‡çš„å®ä½“åŠå…³ç³»ã€‚",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tracy McGrady\"})-[e:serve|like*0..1{start_year: 2000}]-(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡º'player100'çš„æ‰€æœ‰å…³æ³¨å¯¹è±¡ï¼Œç„¶åè·å–ä»–ä»¬çš„å¹´é¾„ï¼Œå¹¶è®¡ç®—å¹³å‡å¹´é¾„å’Œå…³æ³¨å¯¹è±¡çš„æ•°é‡ã€‚",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow\nYIELD dst(edge) AS ID\n| FETCH PROP ON player $-.ID\nYIELD properties(vertex).age AS Age\n| YIELD AVG($-.Age) as Avg_age, count(*)as Num_friends"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º'player100'å®ä½“æ‰€æœ‰å…³è”çš„å®ä½“ï¼Œå…¶ä¸­å®ä½“çš„å§“åå±æ€§ä¸ä¸ºç©ºï¼Œå¹¶è¿”å›è¿™äº›å®ä½“é€šå¾€ç›®çš„åœ°çš„è¾¹ã€‚",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER * WHERE properties($$).name IS NOT EMPTY YIELD dst(edge)"
    },
    {
        "ç”¨æˆ·": "Can you help me find all entities with relationships and their attributes?",
        "æŸ¥è¯¢": "MATCH () -[]-> (v) RETURN *"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the path for the service relationship between player 'Yao Ming' and team 'Rockets'?",
        "æŸ¥è¯¢": "MATCH (p:player {name: 'Yao Ming'} ), (t:team {name: 'Rockets'}), pth = (p)-[:serve*1..4]-(t)\nRETURN pth"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºå¯¹'Duncan'çƒå‘˜æœ‰ä¸¤åˆ°ä¸‰è·³å–œæ¬¢æˆ–æœåŠ¡å…³ç³»æ‰€æœ‰å®ä½“ï¼Œä¸”ä¸è¯¥çƒå‘˜çš„å…³ç³»ç¨‹åº¦ä¸º2åˆ°3è·³ï¼Œä¸”è‹¥ä¸ºå–œæ¬¢å…³ç³»åˆ™å–œæ¬¢ç¨‹åº¦ä¸ºä¸º90ï¼Œè¿”å›è¿™äº›å®ä½“åŠå®ƒä»¬ä¸è¯¥çƒå‘˜çš„å…³ç³»ã€‚",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tim Duncan\"})<-[e:serve|like*2..3{likeness: 90}]-(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Starting from 'player101', can you help me obtain all nodes and edges within one step?",
        "æŸ¥è¯¢": "GET SUBGRAPH 1 STEPS FROM \"player101\" YIELD VERTICES AS nodes, EDGES AS relationships"
    },
    {
        "ç”¨æˆ·": "Find all entities associated with a player named 'Tim Duncan' and arrange them in descending order of age. Skip the first two entities and return their names and ages.",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"}) --> (v2)\nRETURN v2.player.name AS Name, v2.player.age AS Age\nORDER BY Age DESC SKIP 1+1"
    },
    {
        "ç”¨æˆ·": "Hey, hello! I need to find player entities aged 40 or 20 with non blank names. Can you help me return the ID and age information of these entities?",
        "æŸ¥è¯¢": "LOOKUP ON player WHERE player.age IN [40, 20] AND player.name > \"\" YIELD id(vertex) as id, player.age"
    },
    {
        "ç”¨æˆ·": "Find all entities connected by a player named 'Tim Duncan' and return these entities.",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"}) -[*0]-> (v2)\nRETURN v2"
    },
    {
        "ç”¨æˆ·": "Identify all entities that 'player100' is interested in and return the source and target nodes of these entities.",
        "æŸ¥è¯¢": "$a = GO FROM \"player100\" OVER follow YIELD src(edge) AS src, dst(edge) AS dst"
    },
    {
        "ç”¨æˆ·": "Find all the entities that players named 'Tim Duncan' like, including 2-3 degree relationships, and return the number of entities.",
        "æŸ¥è¯¢": "MATCH (:player{name: \"Tim Duncan\"})-[e:like*2..3]-(v)\nRETURN COUNT(1)"
    },
    {
        "ç”¨æˆ·": "Can you help me find information about all entities?",
        "æŸ¥è¯¢": "MATCH (v) RETURN v"
    },
    {
        "ç”¨æˆ·": "Can you help me find a student entity ID with the alias' abc '?",
        "æŸ¥è¯¢": "LOOKUP ON student WHERE student.alias == \"abc\" YIELD id(vertex) as id"
    },
    {
        "ç”¨æˆ·": "Find the names of the top three players and merge them with the names of 'Tony Parker' and 'Ben Simmons' to return.",
        "æŸ¥è¯¢": "MATCH (v:player)\nWITH v.player.name AS n\nRETURN n ORDER BY n LIMIT 3\nUNION\nUNWIND [\"Tony Parker\", \"Ben Simmons\"] AS n\nRETURN n"
    },
    {
        "ç”¨æˆ·": "Identify the relationships between all entities that 'Russell Westbrook' serves' and 'likes', and return these relationship edges.",
        "æŸ¥è¯¢": "GO FROM 'Russell Westbrook' OVER serve, like YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º'player102'å’Œ'player100'å…³æ³¨çš„å®ä½“ï¼Œè¿”å›è¿™äº›å®ä½“çš„IDã€è¾¹çš„åº¦å’Œ'player100'çš„å¹´é¾„ã€‚",
        "æŸ¥è¯¢": "GO FROM \"player102\" OVER follow\nYIELD dst(edge) AS id, properties(edge).degree AS Degree, properties($$).age AS Age\nUNION /* DISTINCT */\nGO FROM \"player100\" OVER follow\nYIELD dst(edge) AS id, properties(edge).degree AS Degree, properties($$).age AS Age"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Tim Duncan' æ‰€å–œæ¬¢çš„å®ä½“çš„ ID å’Œå¯¹åº”çš„å¹´é¾„ï¼Œç­›é€‰å‡ºå¹´é¾„å¤§äº40å²çš„å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„ ID å’Œå¹³å‡å¹´é¾„åŠ 1ã€‚",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" OVER like YIELD like._dst AS dst, $$.player.age AS age\n| YIELD $-.dst AS dst, 1+avg(distinct $-.age) AS age where $-.age > 40"
    },
    {
        "ç”¨æˆ·": "Calculate the total age of all players.",
        "æŸ¥è¯¢": "MATCH (v:player) RETURN sum(v.player.age)"
    },
    {
        "ç”¨æˆ·": "æŸ¥æ‰¾åä¸º'Tracy McGrady'çš„çƒå‘˜æ‰€'å–œæ¬¢'çš„å®ä½“ï¼Œå–œæ¬¢ç¨‹åº¦ä¸º90ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“ä¸è¯¥çƒå‘˜çš„å…³ç³»å’Œå±æ€§ä¿¡æ¯ã€‚",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tracy McGrady\"})-[e:like*0{likeness: 90}]-(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Find entities and their relationships with a 90 likes rating that players known as' Tracy McGrady 'like.",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tracy McGrady\"})-[e:like*1{likeness: 90}]->(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "èƒƒç—…çš„ç—‡çŠ¶æœ‰å“ªäº›ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"èƒƒç—…\" OVER has_symptom YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Find all entities that 'player101' is interested in and return the attention level of these entities.",
        "æŸ¥è¯¢": "GO FROM \"player101\" OVER follow\nYIELD src(edge) AS s, dst(edge) AS d\n| FETCH PROP ON follow $-.s -> $-.d\nYIELD properties(edge).degree"
    },
    {
        "ç”¨æˆ·": "Identify players with a two jump 'follow' relationship with a player named 'Tim Duncan' and a first jump relationship degree greater than 98, and return these players as friends.",
        "æŸ¥è¯¢": "MATCH p=(v:player{name:\"Tim Duncan\"})-[e:follow*2]->(v2)\nWHERE e[0].degree > 98\nRETURN DISTINCT v2 AS Friends"
    },
    {
        "ç”¨æˆ·": "è¯·æ‰¾å‡ºIDä¸º1çš„å®ä½“æ‰€è¿æ¥çš„è¾¹ä¸­ï¼Œæ’åå¤§äº2çš„è¾¹ï¼Œå¹¶è¿”å›è¿™äº›è¾¹çš„èµ·å§‹èŠ‚ç‚¹ã€ç›®æ ‡èŠ‚ç‚¹ã€æ’åå’Œå±æ€§p1ã€‚æœ€åæŒ‰ç…§æ’åé™åºæ’åºã€‚",
        "æŸ¥è¯¢": "GO FROM \"1\"\nOVER e1\nWHERE rank(edge) > 2\nYIELD src(edge), dst(edge), rank(edge) AS Rank, properties(edge).p1 |\nORDER BY $-.Rank DESC"
    },
    {
        "ç”¨æˆ·": "Can you help me find the names of the first three people?",
        "æŸ¥è¯¢": "MATCH (v)\nRETURN v.person.name LIMIT 3"
    },
    {
        "ç”¨æˆ·": "è¿”å›æ‰€æœ‰å›¢é˜Ÿçš„IDã€‚",
        "æŸ¥è¯¢": "MATCH (v:team)\nRETURN id(v)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåä¸º'Yao Ming'çš„çƒå‘˜æ‰€æœåŠ¡çš„2-3è·³å®ä½“ï¼Œå¹¶è¿”å›åŸå§‹å®ä½“çš„åç§°ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player {name: \"Yao Ming\"})-[:serve*2..3]->() RETURN v.player.name"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me search for the entities that Tim Duncan has served since 2000, including service relationships and the entity itself? Can you traverse steps 2 to 3?",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tim Duncan\"})-[e:serve*2..3{start_year: 2000}]->(v)\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "ç™½è¡€ç—…çš„ç—‡çŠ¶æœ‰å“ªäº›ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'ç™½è¡€ç—…'})-[e:has_symptom]->(n1:symptom) return n1.symptom.name"
    },
    {
        "ç”¨æˆ·": "å¾—äº†é«˜è¡€å‹éœ€è¦åšå“ªäº›æ£€æŸ¥ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é«˜è¡€å‹\" OVER need_check YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "æ‚¨å¥½,å¸®å¿™æ‰¾å‡ºæ‰€æœ‰æ ‡ç­¾ä¸ºplayerå’Œbachelorçš„å®ä½“ï¼Œå¯ä»¥å—ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (v:player:bachelor) RETURN v"
    },
    {
        "ç”¨æˆ·": "è¿”å›æ‰€æœ‰çƒå‘˜ä¸­å¹´é¾„æœ€å°çš„çƒå‘˜çš„å¹´é¾„ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player) RETURN min(v.player.age)"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find records of type e1 where col1 is equal to 1 and col5 is equal to '11:11:11:11', and return the source and target nodes of these records to me?",
        "æŸ¥è¯¢": "LOOKUP ON e1 WHERE e1.col1 == 1 AND e1.col5 == time(\"11:11:11\") YIELD src(edge) as src, dst(edge) as dst"
    },
    {
        "ç”¨æˆ·": "Delete all entities and their edges that 'Russell Westbrook' likes'.",
        "æŸ¥è¯¢": "$var = GO FROM \"Russell Westbrook\" OVER like YIELD like._dst as id; DELETE VERTEX $var.id WITH EDGE"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find all entities related to 'Marco Bellelli' and return their information to me.",
        "æŸ¥è¯¢": "MATCH (v:player)-[e]-(v2)\nWHERE id(v)=='Marco Belinelli'\nRETURN v2"
    },
    {
        "ç”¨æˆ·": "If the name of the team tag does not exceed 20 characters in length, can you help me create an index of the team tag?",
        "æŸ¥è¯¢": "CREATE TAG INDEX IF NOT EXISTS team_index ON team(name(20))"
    },
    {
        "ç”¨æˆ·": "Can you help me return the current hours of time?",
        "æŸ¥è¯¢": "RETURN datetime().hour"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the name attribute of an entity with entity type player and name 'Boris Diaw', and return the name attribute to me twice?",
        "æŸ¥è¯¢": "FETCH PROP ON player 'Boris Diaw' YIELD player.name, player.name"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the name and age information of 'Boris Diaw'?",
        "æŸ¥è¯¢": "FETCH PROP ON * 'Boris Diaw' yield player.name, player.age"
    },
    {
        "ç”¨æˆ·": "Please help me identify all entities that 'player101' is interested in and return their IDs and attention levels.",
        "æŸ¥è¯¢": "$var1 = GO FROM \"player101\" OVER follow\nYIELD properties(edge).degree AS Degree, dst(edge) as ID"
    },
    {
        "ç”¨æˆ·": "Identify all entities that can be reached through a 'like' relationship in up to 3 steps starting from 'Tim Duncan' and return their paths.",
        "æŸ¥è¯¢": "$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\nFIND ALL PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "If there is no only_ Can we create a point label with geographic location information?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS only_point(geo geography(point))"
    },
    {
        "ç”¨æˆ·": "è¿”å›æ‰€æœ‰çƒå‘˜çš„å¹´é¾„çš„æ ‡å‡†å·®ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player) RETURN std(v.player.age)"
    },
    {
        "ç”¨æˆ·": "Find an entity with a distance of 1 to 3 served by a player named 'Yao Ming' and return the name of the starting entity.",
        "æŸ¥è¯¢": "MATCH (v:player {name: \"Yao Ming\"})-[:serve*1..3]->() RETURN v.player.name"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the names of the first three people?",
        "æŸ¥è¯¢": "MATCH (v)\nRETURN v.person.name LIMIT 3"
    },
    {
        "ç”¨æˆ·": "Find the entities that Tim Duncan likes or serves, and if their 'service start year' is greater than 1970 or their 'age' is less than 50, return the ID and edge information of these entities.",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" OVER like, serve\n  WHERE serve.start_year > 1970 OR properties($$).age < 50\n  YIELD $$ AS dst, edge AS e"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºä» 'Tim Duncan' å¼€å§‹ï¼Œé€šè¿‡ 'å–œæ¬¢' å…³ç³»æœ€å¤šä¸‰æ­¥å¯åˆ°è¾¾çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„è·¯å¾„ã€‚",
        "æŸ¥è¯¢": "$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\nFIND NOLOOP PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the start year, end year, and relationship type of 'Boris Diaw' during the 'Hawks' validity period?",
        "æŸ¥è¯¢": "FETCH PROP ON serve 'Boris Diaw' -> 'Hawks' YIELD serve.start_year, serve.end_year, edge as relationship"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Tim Duncan' æ‰€ 'å–œæ¬¢' çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„æºèŠ‚ç‚¹IDã€çƒå‘˜å¹´é¾„ã€åå­—å’Œå–œæ¬¢ç¨‹åº¦çš„æ‹¼æ¥ç»“æœã€‚",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" over like YIELD concat(like._src, $^.player.age, $$.player.name, like.likeness) AS A"
    },
    {
        "ç”¨æˆ·": "Hello, could you help me find the shortest path from 'Tiago Splitter' to 'Tony Parker'? The path can only have one step at most, and can you tell me what the path is?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tiago Splitter\" TO \"Tony Parker\" OVER * UPTO 1 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "å¾—äº†é«˜è¡€å‹å¿Œåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é«˜è¡€å‹\" OVER no_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "ç³–å°¿ç—…çš„ç—‡çŠ¶æœ‰å“ªäº›ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:has_symptom]->(n1:symptom) WHERE n.disease.name=='ç³–å°¿ç—…' return n1.symptom.name"
    },
    {
        "ç”¨æˆ·": "Find the entities that Tony Parker likes, with a liking level of not 95, 56, or 21, and return the names and liking levels of these entities and Tony Parker.",
        "æŸ¥è¯¢": "$A = GO FROM 'Tony Parker' OVER like YIELD like._dst AS ID;\nGO FROM $A.ID OVER like WHERE like.likeness NOT IN [95,56,21]\nYIELD $^.player.name, $$.player.name, like.likeness"
    },
    {
        "ç”¨æˆ·": "å¾—äº†è‚ºç‚éœ€è¦åƒä»€ä¹ˆè¯ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"è‚ºç‚\" OVER recommend_drug YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºå¹´é¾„åœ¨20åˆ°25å²ä¹‹é—´çš„çƒå‘˜çš„å§“åå’Œå¹´é¾„ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player)\nWHERE v.player.age IN range(20,25)\nRETURN v.player.name, v.player.age"
    },
    {
        "ç”¨æˆ·": "æŸ¥æ‰¾ä¸åä¸º'Tim Duncan'çš„çƒå‘˜æœ‰ä¸¤åˆ°ä¸‰è·³æœåŠ¡æˆ–å–œæ¬¢å…³ç³»çš„å®ä½“ï¼Œè®°å½•è·¯å¾„æ•°é‡ã€‚",
        "æŸ¥è¯¢": "MATCH (:player{name:\"Tim Duncan\"})-[e:serve|like*2..3]-(v)\nRETURN COUNT(e)"
    },
    {
        "ç”¨æˆ·": "Find all entities that 'player100' is' interested in 'and return the team and player names to which these entities belong.",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow\nYIELD dst(edge) AS id |\nGO FROM $-.id OVER serve\nYIELD properties($^).name AS Player, properties($$).name AS Team"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find the intersection of 'Tony Parker', 'Tim Duncan', and 'Yao Ming' entities related to nodes of type 'player'.",
        "æŸ¥è¯¢": "UNWIND [\"Tony Parker\", \"Tim Duncan\", \"Yao Ming\"] AS a MATCH (v:player) WHERE v.player.name == a RETURN distinct a, v"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Russell Westbrook' æ‰€ 'æœåŠ¡' æˆ– 'å–œæ¬¢' çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›è¾¹çš„ç±»å‹å’Œå±æ€§ã€‚",
        "æŸ¥è¯¢": "GO FROM \"Russell Westbrook\" OVER serve, like  YIELD properties(edge) as props, type(edge) as type"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºå‰ä¸‰ä¸ªçƒå‘˜çš„åå­—ï¼Œå¹¶å°†'Tony Parker'å’Œ'Ben Simmons'çš„åå­—å±•å¼€è¿”å›ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player)\nWITH v.player.name AS n\nRETURN n ORDER BY n LIMIT 3\nUNION ALL\nUNWIND [\"Tony Parker\", \"Ben Simmons\"] AS n\nRETURN n"
    },
    {
        "ç”¨æˆ·": "If only_ The linestring tag does not exist. Can you help me create an only containing geographic information of type linestring_ What about the linestring tag?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS only_linestring(geo geography(linestring))"
    },
    {
        "ç”¨æˆ·": "If possible, could you please_ Create a shape label named any_ Shape_ Geo_ Is the index based on the geo attribute?",
        "æŸ¥è¯¢": "CREATE TAG INDEX IF NOT EXISTS any_shape_geo_index ON any_shape(geo)"
    },
    {
        "ç”¨æˆ·": "Can you help me submit a compression task?",
        "æŸ¥è¯¢": "SUBMIT JOB COMPACT"
    },
    {
        "ç”¨æˆ·": "Please find an entity with the player's name 'Tim Duncan', or an entity under 30 with the name 'Yao Ming', or an entity whose name is neither 'Yao Ming' nor 'Tim Duncan', and tell me their name and age.",
        "æŸ¥è¯¢": "MATCH (v:player)\nWHERE v.player.name == \"Tim Duncan\"\nXOR (v.player.age < 30 AND v.player.name == \"Yao Ming\")\nOR NOT (v.player.name == \"Yao Ming\" OR v.player.name == \"Tim Duncan\")\nRETURN v.player.name, v.player.age"
    },
    {
        "ç”¨æˆ·": "Find all followers of 'player101' who are 35 years old or older and return their names and ages.",
        "æŸ¥è¯¢": "GO FROM \"player101\" OVER follow WHERE properties($$).age >= 35\nYIELD properties($$).name AS Teammate, properties($$).age AS Age"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º'player102'å’Œ'player100'æ‰€'å…³æ³¨'çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„è¾¹çš„ç›®æ ‡èŠ‚ç‚¹",
        "æŸ¥è¯¢": "GO FROM \"player102\" OVER follow YIELD dst(edge)\nUNION ALL\nGO FROM \"player100\" OVER follow YIELD dst(edge)"
    },
    {
        "ç”¨æˆ·": "Please identify all players who do not end with 'R' and tell me their names and ages.",
        "æŸ¥è¯¢": "MATCH (v:player)\nWHERE NOT v.player.name ENDS WITH \"R\"\nRETURN v.player.name, v.player.age"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find those players whose names contain 'Tim', and tell me the age of the people they like, whether they like 'Tony Parker', and tell me their relationship with 'Tony Parker'.",
        "æŸ¥è¯¢": "LOOKUP ON player\nWHERE player.name CONTAINS 'Tim'\nYIELD player.age AS age, id(vertex) AS vid |\nGO FROM $-.vid\nOVER like REVERSELY\nYIELD\n  $-.age AS age,\n  ('Tony Parker' == like._dst) AS liked,\n  like._src AS src,\n  like._dst AS dst"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡º'player100'æ‰€'å…³æ³¨'çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„ IDã€‚",
        "æŸ¥è¯¢": "$var = GO FROM \"player100\" OVER follow YIELD dst(edge) AS id"
    },
    {
        "ç”¨æˆ·": "Find all the names, incorrect tags, and attribute information that players known as' Tim Duncan 'like.",
        "æŸ¥è¯¢": "MATCH (v:player)-[:like]->(t) WHERE v.player.name==\"Tim Duncan\" RETURN v.player.name, t.errortag.name, properties(v), t"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the IDs of all entities starting from 'Tim Duncan' and following the 'serve' relationship outward through steps 1 to 10?",
        "æŸ¥è¯¢": "GO 1 TO 10 STEPS FROM \"Tim Duncan\" OVER serve YIELD $$ as dst"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºTim Duncanæ‰€æœåŠ¡è¿‡çš„çƒé˜ŸåŠèµ·å§‹å¹´ä»½ï¼Œä»¥åŠTony Parkeræ‰€æœåŠ¡è¿‡çš„çƒé˜ŸåŠèµ·å§‹å¹´ä»½ï¼Œå¹¶å°†ä¸¤è€…ç»“æœå»é‡åˆå¹¶ã€‚",
        "æŸ¥è¯¢": "(GO FROM \"Tim Duncan\" OVER like YIELD like._dst as id |\n   GO FROM $-.id OVER serve YIELD $^.player.name, serve.start_year, $$.team.name)\nUNION DISTINCT\nGO FROM \"Tony Parker\" OVER serve YIELD $^.player.name, serve.start_year, $$.team.name"
    },
    {
        "ç”¨æˆ·": "Find all entities that 'Tim Duncan' likes' or 'is liked' by, and return edge information between these entities and 'Tim Duncan'.",
        "æŸ¥è¯¢": "GO FROM 'Tim Duncan' OVER like bidirect YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "Find all relationships' serve 'by' player666 ',' player667 ', and' player668 ', and return the start and end years of these relationships.",
        "æŸ¥è¯¢": "GO FROM \"player666\", \"player667\", \"player668\"\nOVER serve\nYIELD properties(edge).start_year, properties(edge).end_year"
    },
    {
        "ç”¨æˆ·": "Could you please help me find all the information about 'Boris Diaw', including his name and age?",
        "æŸ¥è¯¢": "FETCH PROP ON * 'Boris Diaw', 'Boris Diaw' yield player.name, player.age"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the name and age of 'Boris Diaw'?",
        "æŸ¥è¯¢": "FETCH PROP ON * 'Boris Diaw' yield player.name, player.age"
    },
    {
        "ç”¨æˆ·": "è¯·é—®æ‚¨èƒ½å¸®æˆ‘æ‰¾åˆ°æ‰€æœ‰ä¸'Tim Duncan'æœ‰å…³çš„è¾¹å¹¶æä¾›ç›¸å…³ä¿¡æ¯å—ï¼Ÿ",
        "æŸ¥è¯¢": "GO 0 STEPS FROM 'Tim Duncan' OVER serve YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "Can you help me find the relevant test_ Comment_ Do you have detailed information about tag tags?",
        "æŸ¥è¯¢": "DESC tag test_comment_tag;"
    },
    {
        "ç”¨æˆ·": "å¾—äº†ç³–å°¿ç—…æ¨èåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:recommend_eat]->(n1:food) WHERE n.disease.name=='ç³–å°¿ç—…' return n1.food.name"
    }
]