[
    {
        "ç”¨æˆ·": "May I ask if you could help me find the start year, end year, and relationship type of 'Boris Diaw' during his tenure with 'Hawks'?",
        "æŸ¥è¯¢": "FETCH PROP ON serve 'Boris Diaw' -> 'Hawks' YIELD serve.start_year, serve.end_year, edge as relationship"
    },
    {
        "ç”¨æˆ·": "Hey, hello! I need to find all the entities that have previously provided services to 'Thunders', and then return their source nodes, labels on edges, edge IDs, target nodes, and target node IDs. Can you help me complete this task?",
        "æŸ¥è¯¢": "GO FROM 'Thunders' OVER serve REVERSELY YIELD $^ as src,tags($^), id($^), id($$), $$ as dst"
    },
    {
        "ç”¨æˆ·": "Hey, I want to start with 'Tim Duncan' and extend 10 steps outward along the 'serve' relationship. Can you help me return the IDs of all the extended entities?",
        "æŸ¥è¯¢": "GO 10 STEPS FROM \"Tim Duncan\" OVER serve YIELD $$ as dst"
    },
    {
        "ç”¨æˆ·": "æ‚¨å¥½ï¼Œè¯·å¸®æˆ‘æ‰¾å‡ºä»¥ 'Russell Westbrook' ä¸ºèµ·ç‚¹ï¼Œé€šè¿‡ä»»æ„è¾¹åå‘åˆ°è¾¾çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“åœ¨ serve å’Œ like å±æ€§ä¸­çš„æºå®ä½“ IDã€‚",
        "æŸ¥è¯¢": "GO FROM \"Russell Westbrook\" OVER * REVERSELY YIELD serve._dst, like._dst"
    },
    {
        "ç”¨æˆ·": "æ‚¨å¥½ï¼Œè¯·å¸®æˆ‘æŸ¥æ‰¾ä¸€ä¸‹'Boris Diaw'æ›¾ç»ä¸ºå“ªäº›å®ä½“å·¥ä½œè¿‡ï¼Œä»¥åŠè¿™äº›å®ä½“ä¹‹é—´çš„å…³ç³»å’ŒæœåŠ¡æ—¶é—´ã€‚",
        "æŸ¥è¯¢": "$var = GO FROM 'Boris Diaw','Boris Diaw' OVER serve YIELD serve._src AS src, serve._dst AS dst;\nFETCH PROP ON serve $var.src->$var.dst YIELD DISTINCT serve.start_year, serve.end_year, edge as relationship"
    },
    {
        "ç”¨æˆ·": "Please identify all entities that start with 'player100' and have a 'follow' relationship, and have a degree greater than 90 in the attributes of the edge or an age not equal to 33 in the endpoint entity and a name not equal to 'Tony Parker', and return the attributes of these entities. Can you help me with it?",
        "æŸ¥è¯¢": "GO FROM \"player100\"\nOVER follow\nWHERE properties(edge).degree > 90\nOR properties($$).age != 33\nAND properties($$).name != \"Tony Parker\"\nYIELD properties($$)"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡ºä»åä¸º'Tim Duncan'çš„çƒå‘˜å‡ºå‘ï¼Œåˆ°è¾¾å…¶ä»–å®ä½“ä¹‹é—´çš„æ‰€æœ‰å…³ç³»ï¼Œå¹¶è¿”å›è¿™äº›å…³ç³»ã€‚",
        "æŸ¥è¯¢": "MATCH p=(v:player{name:\"Tim Duncan\"})-->(v2)\nRETURN relationships(p)"
    },
    {
        "ç”¨æˆ·": "æŸ¥æ‰¾åä¸º'abc'çš„çƒå‘˜æ‰€æœåŠ¡çš„è·ç¦»ä¸º1åˆ°3çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›å®ƒä»¬çš„æ‰€æœ‰å±æ€§ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player{name: \"abc\"}) -[:serve*1..3]-> ()\nRETURN *"
    },
    {
        "ç”¨æˆ·": "Can you help me find all the edges related to 'Tim Duncan' and provide relevant information?",
        "æŸ¥è¯¢": "GO 0 STEPS FROM 'Tim Duncan' OVER serve YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "Can you help me generate a random 64 bit integer in the range of 1 to 100?",
        "æŸ¥è¯¢": "RETURN rand64(1,100)"
    },
    {
        "ç”¨æˆ·": "Can you help me add a 10 length index with the attribute 'teacher' on the student tab?",
        "æŸ¥è¯¢": "CREATE TAG INDEX student_teacher ON student(teacher(10))"
    },
    {
        "ç”¨æˆ·": "Find the gender and age attributes of a player known as LaMarcus Aldridge.",
        "æŸ¥è¯¢": "match (v:player) where properties(v).name==\"LaMarcus Aldridge\" return v.player.sex,properties(v).age;"
    },
    {
        "ç”¨æˆ·": "If edge e1 does not exist, can you help me create an edge of e1 and set the property p1 of edge e1 to an integer type?",
        "æŸ¥è¯¢": "CREATE EDGE IF NOT EXISTS e1(p1 int)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºIDä¸ºplayer101çš„çƒå‘˜æ‰€å…³æ³¨çš„çƒå‘˜ï¼Œå¹¶æŒ‰å…³æ³¨äººæ•°ä»å¤šåˆ°å°‘æ’åºï¼Œè¿”å›çƒå‘˜çš„å§“åå’Œå…³æ³¨äººæ•°ã€‚",
        "æŸ¥è¯¢": "MATCH (v1:player)-[:follow]-(v2:player)\nWHERE id(v1)== \"player101\"\nRETURN v2.player.name AS Name, count(*) as cnt ORDER BY cnt DESC"
    },
    {
        "ç”¨æˆ·": "å¾—äº†é£æ¹¿ç—…æ¨èåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é£æ¹¿ç—…\" OVER recommend_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡ºä»¥'player100'ä¸ºèµ·ç‚¹ï¼Œé€šè¿‡'follow'å…³ç³»è¿æ¥çš„å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„'Team'å’Œ'Player'å±æ€§ã€‚",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow YIELD dst(edge) AS id |\nGO FROM $-.id OVER serve YIELD properties($$).name AS Team,\nproperties($^).name AS Player"
    },
    {
        "ç”¨æˆ·": " å˜¿ï¼Œä½ èƒ½å¸®æˆ‘æŸ¥æ‰¾ä¸€ä¸‹åå­—é‡Œæœ‰'Tim'çš„çƒå‘˜å—ï¼Ÿç„¶åçœ‹çœ‹ä»–ä»¬å–œæ¬¢çš„äººé‡Œæœ‰æ²¡æœ‰'Tony Parker'ï¼Œæœ€åå‘Šè¯‰æˆ‘è¿™äº›çƒå‘˜çš„å¹´é¾„å¥½å—ï¼Ÿ",
        "æŸ¥è¯¢": "LOOKUP ON player\nWHERE player.name CONTAINS 'Tim'\nYIELD player.age as age, id(vertex) as vid |\nGO FROM $-.vid OVER like REVERSELY YIELD $-.age AS age, like._dst AS dst |\nYIELD\n  any(d IN COLLECT(DISTINCT $-.dst) WHERE d=='Tony Parker') AS d,\n  $-.age as age"
    },
    {
        "ç”¨æˆ·": "æ‚¨å¥½ï¼Œè¯·å¸®æˆ‘æ‰¾å‡ºä¸ 'Tim Duncan' ç›¸å…³çš„å®ä½“ï¼Œè¿™äº›å®ä½“åœ¨ 'like' å…³ç³»ä¸­çš„ç›®æ ‡å®ä½“çš„ IDã€‚",
        "æŸ¥è¯¢": "GO 2 STEPS FROM \"Tim Duncan\" OVER like YIELD like._dst AS dst | YIELD DISTINCT $-.dst AS dst"
    },
    {
        "ç”¨æˆ·": "Find all entities that 'player100' is interested in and return the entities that these entities are interested in.",
        "æŸ¥è¯¢": "GO FROM \"player100\" OVER follow\nYIELD dst(edge) AS dstid, properties($$).name AS Name |\nGO FROM $-.dstid OVER follow YIELD dst(edge)"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Tim Duncan' å’Œ 'Tony Parker' å–œæ¬¢çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“ä¸ä»–ä»¬ä¹‹é—´çš„å…³ç³»ã€‚",
        "æŸ¥è¯¢": "YIELD {a:1, b:['Tim Duncan', 'Tony Parker'], c:'Tim Duncan'} AS a\n| YIELD $-.a.c AS b\n| UNWIND $-.b AS c\n| GO FROM $-.c OVER like YIELD edge AS e"
    },
    {
        "ç”¨æˆ·": "If the person tag does not exist, can you help me create a person tag with attribute p1 and data type integer?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS person(p1 int)"
    },
    {
        "ç”¨æˆ·": "Find all players with scores less than 20 and return their names.",
        "æŸ¥è¯¢": "MATCH (v:player) WHERE v.player.score < 20 RETURN v.player.name AS name"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find out. Starting from 'Tim Duncan' and following the 'serve' relationship, after 10 steps, can we return the IDs of all entities?",
        "æŸ¥è¯¢": "GO 10 STEPS FROM \"Tim Duncan\" OVER serve YIELD $$ as dst"
    },
    {
        "ç”¨æˆ·": "Could you please insert a geographic location with a polygonal shape on the vertex with ID 103?",
        "æŸ¥è¯¢": "INSERT VERTEX any_shape(geo) VALUES \"103\":(ST_GeogFromText(\"POLYGON((0 1, 1 2, 2 3, 0 1))\"))"
    },
    {
        "ç”¨æˆ·": "æ‚¨å¥½ï¼Œè¯·å¸®æˆ‘æŸ¥æ‰¾ä¸€ä¸‹ä» 'Tim Duncan' å‡ºå‘ï¼Œæ²¿ç€ 'serve' å…³ç³»å‘å¤–æ‰©å±•ä¸¤æ­¥çš„è·¯å¾„ï¼Œç„¶åè¿”å›ç»è¿‡çš„è¾¹ä¿¡æ¯å¥½å—ï¼Ÿ",
        "æŸ¥è¯¢": "GO 2 STEPS FROM \"Tim Duncan\" OVER serve YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "Hey, can you help me? I want to traverse all edges in reverse, starting from 'Russell Westbrook', and find all source entity IDs with attributes' serve 'and' like '.",
        "æŸ¥è¯¢": "GO FROM \"Russell Westbrook\" OVER * REVERSELY YIELD serve._src, like._src"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Boris Diaw' æ‰€åœ¨çš„æ‰€æœ‰çƒé˜Ÿï¼Œå¹¶è¿”å›èµ·ç‚¹å§“åï¼Œèµ·å§‹æœåŠ¡æ—¶é—´ã€è¿™äº›çƒé˜Ÿçš„åç§°ä»¥åŠçƒé˜Ÿä¿¡æ¯ã€‚",
        "æŸ¥è¯¢": "GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team | YIELD $-.team"
    },
    {
        "ç”¨æˆ·": "è¯·æ‰¾å‡ºå¹´é¾„å°äº21å²çš„çƒå‘˜çš„å§“åå’Œå¹´é¾„ï¼Œè°¢è°¢ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player)\nWHERE v[toLower(\"AGE\")] < 21\nRETURN v.player.name, v.player.age"
    },
    {
        "ç”¨æˆ·": "å¾—äº†èƒƒç‚çš„æ²»ç–—æ–¹æ³•æœ‰å“ªäº›ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'èƒƒç‚'})-[e:cure_way]->(n1:cure) return n1.cure.name"
    },
    {
        "ç”¨æˆ·": "Can you help me update the 'teacher' attribute of a student named 'Alen' to 'Bob'?",
        "æŸ¥è¯¢": "UPDATE VERTEX ON student \"Alen\" SET teacher = \"Bob\""
    },
    {
        "ç”¨æˆ·": "Can you help me count the number of nodes with edges between two nodes?",
        "æŸ¥è¯¢": "MATCH () --> (v) --> () RETURN count(*)"
    },
    {
        "ç”¨æˆ·": "Find the start year of all games played by a player named 'Tim Duncan', calculate the average, and return it.",
        "æŸ¥è¯¢": "match (v0:player)-[e0]->(v1) where id(v0) == \"Tim Duncan\" unwind e0.start_year as a return avg(a)"
    },
    {
        "ç”¨æˆ·": "Can you help me calculate the Label_ Number of entities of type 0?",
        "æŸ¥è¯¢": "match p = (v:Label_0)\nreturn count(p)"
    },
    {
        "ç”¨æˆ·": "Can you help me delete the label ddl_ Tag and edge ddl_ Edge?",
        "æŸ¥è¯¢": "DROP TAG ddl_tag;\nDROP EDGE ddl_edge;"
    },
    {
        "ç”¨æˆ·": "If the test space does not exist, can you help me create a space called test, where the ID type of the entity is a fixed length string of 30?",
        "æŸ¥è¯¢": "CREATE SPACE IF NOT EXISTS test (vid_type=FIXED_STRING(30))"
    },
    {
        "ç”¨æˆ·": "Can you help me identify all entities related to 'Tim Duncan' and provide their edge endpoint information?",
        "æŸ¥è¯¢": "GO FROM 'Tim Duncan' OVER * YIELD dst(edge) as dst"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºä» 'Tim Duncan' å¼€å§‹ï¼Œé€šè¿‡ 'å–œæ¬¢' å…³ç³»æœ€å¤šç»è¿‡ä¸‰ä¸ªèŠ‚ç‚¹èƒ½åˆ°è¾¾çš„æ‰€æœ‰å®ä½“è·¯å¾„ï¼Œå¹¶æŒ‰è·¯å¾„é•¿åº¦æ’åºï¼Œè¿”å›å‰äº”æ¡è·¯å¾„ã€‚",
        "æŸ¥è¯¢": "$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\nFIND NOLOOP PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p |\nORDER BY $-.p | LIMIT 5"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find out, starting with 'Tim Duncan' and extending the 'like' relationship in two directions by four steps, and then returning all entities and relationships to me?",
        "æŸ¥è¯¢": "GET SUBGRAPH 4 steps from 'Tim Duncan' BOTH like YIELD VERTICES as nodes, EDGES as relationships"
    },
    {
        "ç”¨æˆ·": "Can you help me find the shortest path from 'Tim Duncan' to 'Tony Parker' through a liking relationship?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like YIELD path as p"
    },
    {
        "ç”¨æˆ·": "æŸ¥æ‰¾ 'Paul George' æ‰€ 'å–œæ¬¢' çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„ IDã€‚",
        "æŸ¥è¯¢": "GO FROM \"Paul George\" OVER like YIELD like._dst"
    },
    {
        "ç”¨æˆ·": "Find all entities served by 'player100' and return the start and end years of these entities.",
        "æŸ¥è¯¢": "GO FROM \"player100\"\nOVER serve\nYIELD properties(edge).start_year, properties(edge).end_year"
    },
    {
        "ç”¨æˆ·": "Can you help me download the files in HDFS locally?",
        "æŸ¥è¯¢": "SUBMIT JOB DOWNLOAD HDFS \"hdfs://<hadoop_address>:<hadoop_port>/<sst_file_path>"
    },
    {
        "ç”¨æˆ·": "Find all players under the age of 25 and sort them in descending order of age, returning the names and ages of these players.",
        "æŸ¥è¯¢": "MATCH (v:player)-->(v2:player)\nWITH DISTINCT v2 AS v2, v2.player.age AS Age\nORDER BY Age\nWHERE Age<25\nRETURN v2.player.name AS Name, Age"
    },
    {
        "ç”¨æˆ·": "Can you help me calculate the result of subtracting negative number 1 from number 1?",
        "æŸ¥è¯¢": "YIELD 1- -1"
    },
    {
        "ç”¨æˆ·": "ä» 'Yao Ming' å¼€å§‹ï¼Œæ‰¾åˆ°ä¸€æ¡æœ€çŸ­è·¯å¾„ï¼Œè·¯å¾„ä¸ŠåŒ…å« 'å–œæ¬¢' å’Œ 'æœåŠ¡' å…³ç³»ï¼Œç›´åˆ° 'Tony Parker'ï¼Œæœ€å¤š5æ­¥ï¼Œè¿”å›è·¯å¾„ä¿¡æ¯ã€‚",
        "æŸ¥è¯¢": "$a = GO FROM \"Yao Ming\" over like YIELD like._dst AS src;\nFIND SHORTEST PATH FROM $a.src TO \"Tony Parker\" OVER like, serve UPTO 5 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Identify all entities that have been reached through a maximum of 5 steps starting from 'Tim Duncan' through the 'like' and 'service' relationships, and return the paths of these entities.",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst\n| FIND SHORTEST PATH FROM $-.src TO $-.dst OVER like UPTO 5 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "å¾—äº†æˆŠå‹ç—…æ¯’æ€§è‚ç‚åº”è¯¥å»å“ªä¸ªç§‘å®¤å°±è¯Šï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"æˆŠå‹ç—…æ¯’æ€§è‚ç‚\" OVER cure_department YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find the IDs of all entities served by 'Tim Duncan'.",
        "æŸ¥è¯¢": "GO FROM \"Tim Duncan\" OVER serve YIELD serve._dst as id"
    },
    {
        "ç”¨æˆ·": "å¾—äº†ç™½è¡€ç—…å¿Œåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"ç™½è¡€ç—…\" OVER no_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåä¸º'Tim Duncan'çš„çƒå‘˜çš„æ‰€æœ‰æœ‹å‹çš„æœ‹å‹ï¼Œå¹¶è¿”å›æœ‹å‹çš„æœ‹å‹çš„æ•°é‡å’Œå»é‡åçš„æ•°é‡ã€‚",
        "æŸ¥è¯¢": "MATCH (n:player {name : \"Tim Duncan\"})-[]->(friend:player)-[]->(fof:player)\nRETURN count(fof), count(DISTINCT fof)"
    },
    {
        "ç”¨æˆ·": "Hey, hello! I need to start with the entity of 'Tim Duncan', take 100000000000 steps along the 'serve' edge, and then tell me the IDs of all the endpoint entities of the 'serve' edge. Can you help me find it?",
        "æŸ¥è¯¢": "GO 10000000000000 STEPS FROM \"Tim Duncan\" OVER serve YIELD serve._dst;"
    },
    {
        "ç”¨æˆ·": "å¾—äº†è‚ç‚æ¨èä½¿ç”¨å“ªç§è¯ç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'è‚ç‚'})-[e:recommend_drug]->(n1:drug) return n1.drug.name"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the shortest path from 'Tony Parker' and 'Yao Ming' to 'Manu Ginobili', 'Spurs', and' Lakes', and return the path information to me?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * REVERSELY YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Could you please help me search for all entities and relationships that have a 2-3 hop service relationship with 'Tim Duncan' after 2000?",
        "æŸ¥è¯¢": "MATCH (n)-[e:serve*2..3{start_year: 2000}]-(v)\nWHERE id(n) == \"Tim Duncan\"\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "Count the number of relationships between players named 'Tim Duncan' and other entities.",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"}) -[e]- (v2)\nRETURN count(e)"
    },
    {
        "ç”¨æˆ·": "If not, can you help me create a file called only_ What is the attribute of a polygon's label?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS only_polygon(geo geography(polygon))"
    },
    {
        "ç”¨æˆ·": "Can you help me delete a non-existent tag index?",
        "æŸ¥è¯¢": "DROP TAG INDEX IF EXISTS not_exists_tag_index"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡º'player102'æ‰€'æœåŠ¡'çš„æ‰€æœ‰å®ä½“ï¼Œå¹¶è¿”å›è¿™äº›å®ä½“çš„è¾¹çš„ç›®æ ‡èŠ‚ç‚¹",
        "æŸ¥è¯¢": "GO FROM \"player102\" OVER serve YIELD dst(edge)"
    },
    {
        "ç”¨æˆ·": "Hello, I would like to find those students with teacher names less than 'a' and return their IDs. Can you help me?",
        "æŸ¥è¯¢": "LOOKUP ON student WHERE student.teacher < \"a\" YIELD id(vertex) as id"
    },
    {
        "ç”¨æˆ·": "Can you help me identify all the aspects of 'Tim Duncan's' services' and provide relevant information?",
        "æŸ¥è¯¢": "GO 0 STEPS FROM 'Tim Duncan' OVER serve YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "Can you help me obtain the attributes of all entities of 'Boris Diaw' and return their IDs?",
        "æŸ¥è¯¢": "FETCH PROP ON * 'Boris Diaw' YIELD id(vertex)"
    },
    {
        "ç”¨æˆ·": "Can you help me find the name and age of a player named 'Tony Parker'?",
        "æŸ¥è¯¢": "FETCH PROP ON player \"Tony Parker\" YIELD player.name, player.age"
    },
    {
        "ç”¨æˆ·": "ä»€ä¹ˆç—…ä¼šä¼´éšç€å¿ƒè„ç—…ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:accompany_with]->(n1:disease{name:'å¿ƒè„ç—…'}) return n.disease.name"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me identify all edges with relationship weights of 0 and tell me the weight values of the top three?",
        "æŸ¥è¯¢": "match ()-[e]->()\nwhere rank(e) == 0\nRETURN rank(e)\nlimit 3"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåå­—ä¸­åŒ…å«'Tim'çš„çƒå‘˜ï¼Œç„¶åæ‰¾å‡ºä»–ä»¬æ‰€å–œæ¬¢çš„äººï¼Œå¹¶è¿”å›è¿™äº›äººçš„å¹´é¾„ã€æ˜¯å¦å–œæ¬¢'Tony Parker'ã€æºèŠ‚ç‚¹å’Œç›®æ ‡èŠ‚ç‚¹çš„IDã€‚",
        "æŸ¥è¯¢": "$var = LOOKUP ON player\nWHERE player.name CONTAINS 'Tim'\nYIELD player.age AS age, id(vertex) AS vid;\nGO FROM $var.vid\nOVER like REVERSELY\nYIELD\n  $var.age AS age,\n  ('Tony Parker' == like._dst) AS liked,\n  like._src AS src,\n  like._dst AS dst"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºä¸ 'Tim Duncan' æœ‰ 'å–œæ¬¢' æˆ– 'æœåŠ¡' å…³ç³»çš„å®ä½“ä¹‹é—´çš„è·¯å¾„ï¼Œæœ€å¤š3æ­¥ï¼ŒæŒ‰è·¯å¾„é•¿åº¦æ’åºï¼Œè¿”å›å‰5æ¡è·¯å¾„ã€‚",
        "æŸ¥è¯¢": "$a = GO FROM \"Tim Duncan\" over * YIELD like._dst AS src, serve._src AS dst;\nFIND ALL PATH FROM $a.src TO $a.dst OVER like UPTO 3 STEPS YIELD path as p |\nORDER BY $-.p | LIMIT 5"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the students whose names start before 'a' and tell me their ID, name, and age?",
        "æŸ¥è¯¢": "LOOKUP ON student WHERE student.name < \"a\" YIELD id(vertex) as id, student.name as name, student.age as age"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find all entities with a distance of 2 starting from 'Tim Duncan' and through the 'serve' relationship, and return the edge information between these entities?",
        "æŸ¥è¯¢": "GO 2 STEPS FROM \"Tim Duncan\" OVER serve YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡ºåä¸º'Tony Parker'çš„çƒå‘˜æ‰€å…³è”çš„æ‰€æœ‰çƒå‘˜ï¼Œå¹¶è¿”å›å»é‡åçš„çƒå‘˜çš„å§“åå’Œå¹´é¾„ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tony Parker\"})--(v2:player)\nRETURN DISTINCT v2.player.name, v2.player.age"
    },
    {
        "ç”¨æˆ·": "Hello, I would like to inquire about all entities and relationships that have had a 2-3 level 'serve' relationship with 'Tim Duncan' since 2000. Can you help me find them?",
        "æŸ¥è¯¢": "MATCH (n)-[e:serve*2..3{start_year: 2000}]-(v)\nWHERE id(n) == \"Tim Duncan\"\nRETURN e, v"
    },
    {
        "ç”¨æˆ·": "æ‰¾å‡º 'Tim Duncan' æ‰€ 'å–œæ¬¢' çš„å®ä½“åŠå…¶ä¸€åº¦å’ŒäºŒåº¦å…³ç³»ï¼Œè¿”å›è¿™äº›å®ä½“å’Œå…³ç³»çš„æºèŠ‚ç‚¹ã€ç›®æ ‡èŠ‚ç‚¹å’Œè¾¹ä¿¡æ¯ã€‚",
        "æŸ¥è¯¢": "GO FROM 'Tim Duncan' OVER like YIELD like._src as src, like._dst as dst |\nGO 1 TO 2 STEPS FROM $-.src OVER like YIELD $-.src as src, $-.dst, like._dst as dst, edge as e"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the start of the service relationship between 'Zion Williamson' and 'Spurs'_ Year 'attribute value, as well as' serve. start' between 'Boris Diaw' and 'Hawks'_ Is the 'year' attribute value?",
        "æŸ¥è¯¢": "FETCH PROP ON serve \"Zion Williamson\"->\"Spurs\", \"Boris Diaw\"->\"Hawks\" YIELD serve.start_year"
    },
    {
        "ç”¨æˆ·": "å¾—äº†å“®å–˜ä¼šä¼´éšå“ªäº›ç—‡çŠ¶ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'å“®å–˜'})-[e:accompany_with]->(n1:symptom) return n1.symptom.name"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the shortest path connecting 'Tim Duncan' to 'LaMarcus Aldridge' through a liking relationship?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"LaMarcus Aldridge\" OVER like YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the subgraph starting from 'Tim Duncan' and return the first result to me?",
        "æŸ¥è¯¢": "$a = GET SUBGRAPH WITH PROP FROM 'Tim Duncan' | LIMIT 1"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find all entities in type t1 where col3 is false and col1 is greater than or equal to 1, and return their IDs to me?",
        "æŸ¥è¯¢": "LOOKUP ON t1 WHERE t1.col3 == false AND t1.col1 >= 1 YIELD id(vertex) as id"
    },
    {
        "ç”¨æˆ·": "Hello, please help me find entities that meet the following conditions: e1: e1. col1 is greater than or equal to 1, and e1. col5 is greater than the time point '11:11:11:11'. And can you also return the source and target nodes of the edges of these entities to me?",
        "æŸ¥è¯¢": "LOOKUP ON e1 WHERE e1.col1 >= 1 AND e1.col5 > time(\"11:11:11\") YIELD src(edge) as src, dst(edge) as dst"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me check the source nodes, target nodes, and weight values in all the relationships in serve?",
        "æŸ¥è¯¢": "LOOKUP ON serve YIELD src(edge) as src, dst(edge) as dst, rank(edge) as rank"
    },
    {
        "ç”¨æˆ·": "å¾—äº†è‚ºç‚éœ€è¦åšå“ªäº›æ£€æŸ¥ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"è‚ºç‚\" OVER need_check YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find the shortest path from 'Tony Parker' or 'Yao Ming' to 'Manu Ginobili', 'Spurs', and' Lakes'? The path can only have a maximum of 5 steps, all entities and relationships that need to be included in the path, and then return the path information to me, okay?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tony Parker\", \"Yao Ming\" TO \"Manu Ginobili\", \"Spurs\", \"Lakers\" OVER * UPTO 5 STEPS YIELD path as p"
    },
    {
        "ç”¨æˆ·": "å¾—äº†å¿ƒè„ç—…éœ€è¦å»å“ªä¸ªç§‘å®¤çœ‹ç—…ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease{name:'å¿ƒè„ç—…'})-[e:cure_department]->(n1:department) return n1.department.name"
    },
    {
        "ç”¨æˆ·": "å¾—äº†æ°”è™šè¡€ç˜€è¯å¿Œåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"æ°”è™šè¡€ç˜€è¯\" OVER no_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find all the entities served by 'Boris Diaw' and tell me their names, start years, and team names?",
        "æŸ¥è¯¢": "GO FROM \"Boris Diaw\" OVER serve YIELD $^.player.name as name, serve.start_year as start, $$.team.name as team | YIELD $-.*"
    },
    {
        "ç”¨æˆ·": "Hey, I want to start with 'Russell Westbrook' and go through 1-2 steps to find the IDs of all endpoint entities in 'serve' and 'like' relationships. Can you help me search for it?",
        "æŸ¥è¯¢": "GO 1 TO 2 STEPS FROM 'Russell Westbrook' OVER * YIELD serve._dst, like._dst"
    },
    {
        "ç”¨æˆ·": "Hello, please help me identify the nodes labeled 'helper' and return the 'team' attribute values of the endpoint nodes in their 'serve' relationship.",
        "æŸ¥è¯¢": "MATCH (p:bachelor)-[:serve]->(t)\nRETURN t.team.name AS team"
    },
    {
        "ç”¨æˆ·": "è‚ç‚æœ‰å“ªäº›ç—‡çŠ¶ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"è‚ç‚\" OVER has_symptom YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "å¾—äº†æˆŠå‹ç—…æ¯’æ€§è‚ç‚æ¨èåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:recommend_eat]->(n1:food) WHERE n.disease.name=='æˆŠå‹ç—…æ¯’æ€§è‚ç‚' return n1.food.name"
    },
    {
        "ç”¨æˆ·": "Can you help me find the first result in the subgraph starting from 'Tim Duncan'?",
        "æŸ¥è¯¢": "$a = GET SUBGRAPH WITH PROP FROM 'Tim Duncan' | LIMIT 1"
    },
    {
        "ç”¨æˆ·": "å“ªäº›ç—…è¦å»è€³é¼»å–‰ç§‘å°±è¯Šï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:cure_department]->(n1) return n.disease.name"
    },
    {
        "ç”¨æˆ·": "Hello, can you help identify all entities labeled as player and helper?",
        "æŸ¥è¯¢": "MATCH (v:player:bachelor) RETURN v"
    },
    {
        "ç”¨æˆ·": "è¿”å›10ä¸ªæ ‡ç­¾ä¸ºttl_expire_tag03çš„å®ä½“åŠå…¶å±æ€§ã€‚",
        "æŸ¥è¯¢": "MATCH (v:ttl_expire_tag03) RETURN v LIMIT 10;"
    },
    {
        "ç”¨æˆ·": "Can you help me update the teacher for student 'Alen' to 'Bob'?",
        "æŸ¥è¯¢": "UPDATE VERTEX ON student \"Alen\" SET teacher = \"Bob\""
    },
    {
        "ç”¨æˆ·": "Hey, can you help me find the player with 'Tim' in their name? Then let's see if there's any 'Tony Parker' among the people they like, and finally tell me the age of these players, okay?",
        "æŸ¥è¯¢": "LOOKUP ON player\nWHERE player.name CONTAINS 'Tim'\nYIELD player.age as age, id(vertex) as vid |\nGO FROM $-.vid OVER like REVERSELY YIELD $-.age AS age, like._dst AS dst |\nYIELD\n  any(d IN COLLECT(DISTINCT $-.dst) WHERE d=='Tony Parker') AS d,\n  $-.age as age"
    },
    {
        "ç”¨æˆ·": "æˆŠå‹ç—…æ¯’æ€§è‚ç‚çš„ç—‡çŠ¶æœ‰å“ªäº›ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:has_symptom]->(n1:symptom) WHERE n.disease.name=='æˆŠå‹ç—…æ¯’æ€§è‚ç‚' return n1.symptom.name"
    },
    {
        "ç”¨æˆ·": "è¯·å¸®æˆ‘æ‰¾å‡ºåä¸º'Tim Duncan'çš„çƒå‘˜ï¼Œå¹¶è¿”å›è¯¥çƒå‘˜çš„ä¿¡æ¯ã€‚",
        "æŸ¥è¯¢": "MATCH (v:player{name:\"Tim Duncan\"}) RETURN v"
    },
    {
        "ç”¨æˆ·": "Could you please help me delete the tag index person_ Ttl_ 2_ Index_ Number?",
        "æŸ¥è¯¢": "DROP TAG INDEX person_ttl_2_index_number"
    },
    {
        "ç”¨æˆ·": "å¾—äº†é£æ¹¿ç—…ä¸èƒ½åƒä»€ä¹ˆï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é£æ¹¿ç—…\" OVER no_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Can you help me find the shortest path from 'Tiago Splitter' to 'LaMarcus Aldridge'?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tiago Splitter\" TO \"LaMarcus Aldridge\" OVER * YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Could you please help me delete the edge index edge_ 1_ Ttl_ Index_ 2_ Degree?",
        "æŸ¥è¯¢": "DROP EDGE INDEX edge_1_ttl_index_2_degree"
    },
    {
        "ç”¨æˆ·": "Can you display the configuration information of all labels?",
        "æŸ¥è¯¢": "PROFILE format=\"row\" SHOW TAGS"
    },
    {
        "ç”¨æˆ·": "If the person tag does not exist, can you help me create a person tag?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS person(p1 int)"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find all entities in type t1 where col4 is' banana 'and col3 is true, and return their IDs to me?",
        "æŸ¥è¯¢": "LOOKUP ON t1 WHERE t1.col4 == \"banana\" AND t1.col3 == true YIELD id(vertex) as id"
    },
    {
        "ç”¨æˆ·": "Can you help me find out if the dictionary order of all students' teacher names is less than 'a' for entities, and return the IDs of these entities to me?",
        "æŸ¥è¯¢": "LOOKUP ON student WHERE student.teacher < \"a\" YIELD id(vertex) as id"
    },
    {
        "ç”¨æˆ·": "å¾—äº†é«˜è¡€å‹åº”è¯¥å»å“ªä¸ªç§‘å®¤å°±è¯Šï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é«˜è¡€å‹\" OVER cure_department YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "ä»€ä¹ˆç—…å’Œéœå¥‡é‡‘ç—…ä½¿ç”¨ç›¸åŒçš„è¯ç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:recommend_drug]->(n1:drug)<-[e2]-(n2:disease) WHERE n.disease.name=='å¿ƒè„ç—…' return n2.disease.name"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me obtain all the entity attributes of 'Tim Duncan' and return the entity as a node?",
        "æŸ¥è¯¢": "FETCH PROP ON * 'Tim Duncan' YIELD vertex as node"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the start and end years of the 'serve' attribute between 'Tony Parker' and 'Spurs'?",
        "æŸ¥è¯¢": "FETCH PROP ON serve \"Tony Parker\"->\"Spurs\" YIELD serve.start_year, serve.end_year"
    },
    {
        "ç”¨æˆ·": "Could you please help me find the shortest path from 'Tim Duncan' to 'Tony Parker' that is connected through a liking relationship?",
        "æŸ¥è¯¢": "FIND SHORTEST PATH FROM \"Tim Duncan\" TO \"Tony Parker\" OVER like YIELD path as p"
    },
    {
        "ç”¨æˆ·": "Can you help me find the age attribute of the person with ID 1?",
        "æŸ¥è¯¢": "FETCH PROP ON person \"1\" YIELD person.age as age;"
    },
    {
        "ç”¨æˆ·": "Can you help me count the number of entities with edges between two nodes?",
        "æŸ¥è¯¢": "MATCH () --> (v) --> () RETURN count(*)"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find all entities older than 20, starting from 'Russell Westbrook' and after a maximum of two relationships, and return the information of these entities to me?",
        "æŸ¥è¯¢": "GO 1 TO 2 STEPS FROM 'Russell Westbrook' OVER * where properties($$).age > 20 YIELD $$ as dst"
    },
    {
        "ç”¨æˆ·": "If it doesn't exist, can you help me create an arbitrary shape of any with geographic information_ Shape_ What about edge?",
        "æŸ¥è¯¢": "CREATE EDGE IF NOT EXISTS any_shape_edge(geo geography)"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me search for relationships that have been ranked 1 since 2016 and return a maximum of 1000 records?",
        "æŸ¥è¯¢": "match ()-[e]->()\nwhere abs(rank(e)) == 1 and e.start_year == 2016\nRETURN e\nlimit 1000"
    },
    {
        "ç”¨æˆ·": "If only_ The polygon tag does not exist. Can you help me create an only with polygon geographic attributes_ What about the Polygon label?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS only_polygon(geo geography(polygon))"
    },
    {
        "ç”¨æˆ·": "é«˜è¡€å‹æ¨èåƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"é«˜è¡€å‹\" OVER recommend_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "I would like to log in using the Drainer service (192.168.10.106:9889). Can you help me achieve this?",
        "æŸ¥è¯¢": "SIGN IN DRAINER SERVICE(192.168.10.106:9889)"
    },
    {
        "ç”¨æˆ·": "Can you help me generate a random number between 1 and 100?",
        "æŸ¥è¯¢": "RETURN rand32(1,100)"
    },
    {
        "ç”¨æˆ·": "Can you help me return the current date and time?",
        "æŸ¥è¯¢": "RETURN datetime()"
    },
    {
        "ç”¨æˆ·": "If the name of the team label does not exceed 20 characters in length, can you help me create a name called team_ What about the label index of index?",
        "æŸ¥è¯¢": "CREATE TAG INDEX IF NOT EXISTS team_index ON team(name(20))"
    },
    {
        "ç”¨æˆ·": "Hello, could you please help me find a two-step path starting from 'Tim Duncan' and extending outward along the 'serve' relationship, and then return the edge information that has passed?",
        "æŸ¥è¯¢": "GO 2 STEPS FROM \"Tim Duncan\" OVER serve YIELD edge as e"
    },
    {
        "ç”¨æˆ·": "å¾—äº†æˆŠå‹ç—…æ¯’æ€§è‚ç‚åº”è¯¥åšå“ªäº›æ£€æŸ¥ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"æˆŠå‹ç—…æ¯’æ€§è‚ç‚\" OVER need_check YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Could you please help me delete the vertices' LeBron James', 'Dwyane Wade', 'Carmelo Anthony', and their related edges?",
        "æŸ¥è¯¢": "DELETE VERTEX \"LeBron James\", \"Dwyane Wade\", \"Carmelo Anthony\" WITH EDGE;"
    },
    {
        "ç”¨æˆ·": "å¾—äº†è‚ºç™Œä¸èƒ½åƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"è‚ºç™Œ\" OVER no_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Can you please find the names and ages of players under the age of 25?",
        "æŸ¥è¯¢": "MATCH (v:player)-[e]->(v2)\nWHERE v2.player.age < 25\nRETURN v2.player.name, v2.player.age"
    },
    {
        "ç”¨æˆ·": "å¾—äº†å¿ƒè„ç—…åº”è¯¥åƒä»€ä¹ˆé£Ÿç‰©ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"å¿ƒè„ç—…\" OVER recommend_eat YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "Can you help me find all entities that have a 'service' relationship with 'Tim Duncan' and return their IDs?",
        "æŸ¥è¯¢": "YIELD \"Tim Duncan\" as vid | GO FROM $-.vid OVER serve YIELD serve._dst"
    },
    {
        "ç”¨æˆ·": "Hey, hello! I want to start with 'Tim Duncan' and extend the 'serve' relationship outward by 100000000000 steps. Can you help me return the endpoint entities of all the edges I have passed through?",
        "æŸ¥è¯¢": "GO 10000000000000 STEPS FROM \"Tim Duncan\" OVER serve YIELD dst(edge) as dst"
    },
    {
        "ç”¨æˆ·": "Could you please help me check the start and end years of Boris Diaw's service at Hawks?",
        "æŸ¥è¯¢": "FETCH PROP ON serve 'Boris Diaw' -> 'Hawks' YIELD serve.start_year, serve.end_year"
    },
    {
        "ç”¨æˆ·": "å¾—äº†ç³–å°¿ç—…æ¨èåƒä»€ä¹ˆè¯ï¼Ÿ",
        "æŸ¥è¯¢": "GO FROM \"ç³–å°¿ç—…\" OVER recommend_drug YIELD dst(edge);"
    },
    {
        "ç”¨æˆ·": "é«˜è¡€å‹çš„ç—‡çŠ¶æœ‰å“ªäº›ï¼Ÿ",
        "æŸ¥è¯¢": "MATCH (n:disease)-[e:has_symptom]->(n1:symptom) WHERE n.disease.name=='é«˜è¡€å‹' return n1.symptom.name"
    },
    {
        "ç”¨æˆ·": "If there is no only_ Can we create a point label that contains geographic location information?",
        "æŸ¥è¯¢": "CREATE TAG IF NOT EXISTS only_point(geo geography(point))"
    }
]